[{"text": "good. skin smooth and a little bit lighter"}, {"text": "Good for my mums heart. My mum has mitral valve prolapse and take these regularly"}, {"text": "Excellent!. Great, easy to use spray. I am satisfied with this purchase."}, {"text": "Not much effect. Can't tell a difference. Used for a month."}, {"text": "Excellent!. The product works great! Since I started using it my digestive health has improved significantly. As a bonus the chewable tablets taste pretty good too!"}, {"text": "very good. to sweet for me"}, {"text": "Excellent!. This product is half price of the competitors - contains 30ml for the same price of 15ml. And it is also great quality - Vitamin D3, produced in the USA, Kosher and contains only MCT oil and not bad quality oils."}, {"text": "Excellent!. Amazing for your immune system - highly recommend"}, {"text": "Must have.. This is a must have if you have kids. All around good for their immune system."}, {"text": "Good. didn't notice a difference"}, {"text": "Taste is great!. Kids love the taste!"}, {"text": "Kids love them. These gummy vitamins taste great, they are a great price and they are vegan. I am very happy with them!\nI only wish they were a little more potent. They could use a larger dose of Vitamins C and D for sure."}, {"text": "WELL REGARDED COMPANY. WE REQUIRE ABOUT 400MG OF MAGNESIUM DAILY.THIS FORMULA HAS GOOD ABSORBTION AND IS REASONABLY  PRICED."}, {"text": "About this product.. It was just okay. I didn't feel much of a difference when I took this."}, {"text": "Wonderful. No longer have to take natural dessicated thyroid it's so good. Improved my TSH levels immensely."}, {"text": "Excellent!. My favorite prenatal!"}, {"text": "Smell good. I use it to replace butter"}, {"text": "Like a lot. It's refreshing and good taste, soothes my pitta."}, {"text": "Excellent!. Best immune supplement. These surely helped get us through that cold/flu season. After being severely sick this year /I had caught the flu/, my immune system was obviously compromised. Since taking these I have been healthy. The size of the capsules is large but it is not difficult to drink and the price is just perfect!"}, {"text": "Great for my liver!. I love this product. I use it nightly (the liver heals at night, so it's best to take it at bedtime) to keeps my liver healthy and assists in detoxing.\nFor the price point, it's the best one I have found."}, {"text": "Strong. I like the NOW brand. This is strong. If I don’t eat enough it does make my stomach hurt and I get burps. This is not just Oregano please read details."}, {"text": "Positively addicting. A great protein bar. WOuld be even better with less carbs, because I now eat 3 or 4 a day because they are so tasty and easy...."}, {"text": "Excellent anit-oxidiant supplement. Wonderful to help fight cell-damaging free radicals in the body, promote and support optimal health."}, {"text": "Made Me Extremely Dizzy. This product didn’t work for me at all. It made me extremely dizzy to the point the room felt like it was spinning around me. \n\nDo not recommend."}, {"text": "Excellent!. I use it for scrapes-gentle and effective"}, {"text": "Works for me. I take this for chronic lung issues and it seems to help.  I trust the Jarrow brand."}, {"text": "flusymptom. best product there is. At the first flu type feelings start Boiron oscillococcinum and it does not even progress.\r\nTrusanne"}, {"text": "Lung support post COVID.. I was tested COVID positive and was taking NAC to support my lungs health and overall well being during the virus. I havent had any cough thanks to this supplement and others for my immune response. I can boldly say its a go to supplements when sick with cough or flu. Please like if this review was helpful!"}, {"text": "Excellent!. it's really helping my complexion and it moisturizes my skin very well. it gives me a glowing effect."}, {"text": "speedy shipment and perfect conditon. As advertised, it is unflavored and will mix with any beverage that I choose."}, {"text": "Excellent!. It helps my sleep well."}, {"text": "Potassium Iodide. I am very happy with this product & most of the products from NOW.  \nI would be happier if it didn't have as many fillers.  It would make it an even better product, IF IT DIDN'T have any Microcrystalline Cellulose & NO Steariac Acid.\n\nThat said, it has still had the desired effect of helping heal my Thyroid.  I was at the point of not being able to swallow my tablets properly without a lot of help, but after about 3 weeks of taking them, things are turning back to normal."}, {"text": "Buy it. Its fantastic!. Please Iherb keep offering this zinc product! It works great and won't upset my stomach like all other 3 brands I've tried."}, {"text": "good taste. A good-tasting protein snack, not as hard as a lot of other snacks. recommended"}, {"text": "Excellent!. natural remedy, alkalizes the body, improves blood and digestion, useful during pregnancy"}, {"text": "Excellent!. I am my second bottle.  I think the prebiotic also helps with insomnia.  I will continue trying this product."}, {"text": "Can’t Say Anything. I can’t say that it did anything to me. Took it tomtreat my fibroadenoma"}, {"text": "I like the idea of this product but.... I haven't noticed any weight loss, yet. I don't have a lot to lose (8 lbs) so maybe I need more time to better tell about its effectiveness."}, {"text": "It is ok. good but not gentle for stomach"}, {"text": "Great Product!. We are very confident with this product and would recommend to anyone wanting a high quality Vitamin C."}, {"text": "All good. Good effect and Consistent in quality. Have ordered Now Foods Organic Inulin powder several times now and it is completely consistent in quality. Has clearly a positive effect on good bacteria in the large intestine. Also has a positive effect on IBS."}, {"text": "Excellent!. Very Nice Product, I recommend it."}, {"text": "mastic gum. found it works great to lower colestoral and help sex drive is a bonus  delivery is fast to"}, {"text": "Doesn't cause hyperacidity. What i notice is that i don't suffer from hyperacidity and a feeling of being always hungry. My friend noticed that his skin has improved.."}, {"text": "Good product at fair price. I like the fact that veggie caps are being used and that I cannot see any bad ingredients."}, {"text": "Excellent!. It helped a-lot with my nails and hair health, I didn’t notice any hair increase over my body. Delicious and perfect ."}, {"text": "helps reducing hypertension. helps reducing hypertension and helps with smokers complaints."}, {"text": "Another Amazing Product. I really love these guys products.  Also admire what they stand for too. Click on my link above to view my other product reivews and items I've purchased."}, {"text": "Excellent!. The quercitin is superior to others I've tried and the order arrived promptly. Excellent product and service!"}, {"text": "Choleast - this stuff works to reduce cholesterol.. From age 25-59 I always had above average cholesterol readings, but I refused to take statins.  My GP put me onto this, and it works!  After 3 months of 2 capsules a day (and no other changes in my lifestyle) my cholesterol level came into the normal range for the first time.  And now, via I-herb, I'm getting it at half the price I was paying in a chemist shop!"}, {"text": "Quality is good. Good product ??"}, {"text": "Excellent!. Product received in good condition. Thank you."}, {"text": "Excellent!. Mix into my morning drink to meet my daily green needs.  However, the taste takes some getting use to."}, {"text": "Excellent!. Most protein bars feel like I am eating chalky, chocolatey glue. I have been eating Pure Protein bars for a while now and those were my go-to protein bars. Then don’t taste great but I could tolerate eating it to get some extra protein."}, {"text": "Verry helpfull against Candida Albicans  . Verry helpfull against Candida Albicans"}, {"text": "Excellent!. Prescribed by doctor. Works well!"}, {"text": "slight results. this works with slight anxiety and depresion"}, {"text": "Repeat buy. My third buy, I feel like this helps with my mood swings, stabilises my hormones and stress especially during that time of the month. Able to take it with or without food and doesn't make me feel sick. This was also my first Now Foods product and is now one of my favourite brands."}, {"text": "Isn't natural. I thought iherb is suppose to carry everything that is non synthetic & herbal/natural base... feel so tired that I have to do vitamin research still and not just trust a site. I will still shop with you but I wish you could stick to natural stuff.\r\n\r\ndl-Alpha Tocopheryl Acetate is not natural vitamin E!"}, {"text": "Excellent!. Helps soothe my stomach from time to time. Will buy more when I run out"}, {"text": "anti-stress. nice for nerve strengthening and hair loss"}, {"text": "A Must For The Body. Milk thisle have been used for years for its numerous benefits it's acts as a liver detoxifier regenerator and it helps with diabetes candida and several other issues now i take it with nac whenever i do a body detox"}, {"text": "Kid love it. Good.\nLabai skanus :) kelia apetita vaikui."}, {"text": "Good for allergies. Good product. A natural anti-histamine, which is what I use it for."}, {"text": "Great product. This is the best product to alkalize blood and to raise immunity of the body. My whole family loves it!"}, {"text": "About this product.. i don’t know yet but i will get better:)"}, {"text": "Excellent!. Time released vitamin C seems to be easier on the system if taking them multiple times throughout the day. The NOW Brand is one that I have trusted over the past 20 years. I would not hesitate to buy this again."}, {"text": "Review. Good prices, fast shipiing. I've used this company for years and will continue to do so."}, {"text": "Excellent!. The kids love it.  I take it not for the first time.  I am satisfied with the quality"}, {"text": "Excellent!. Great and gives me energy for my workout"}, {"text": "Buy proten and omiga 3. all produit is original . Thanks ."}, {"text": "Very effective. One of the best I've tried. Very effective and inexpensive"}, {"text": "Excellent!. My daughter loves this stuff. \n\nAlways fast delivery from iHerb"}, {"text": "Good with your reg. Probiotic. Just received this, not really just yet. A Doctor says this is good to go with my Probiotic!"}, {"text": "Avocado 300 Soy Unsaponifiables 600mg. I've been taking these tablets one a day for the last 4 years. for severe osteoarthritis knee. Soon after  i stopped needing any other pain killers or anti-inflammatories for my knee. They actually work!"}, {"text": "Excellent!. Good for inflammation and the gut."}, {"text": "Excellent!. An adult needs a maximum of 3 grams of zinc daily. Over 60% of this amount is used to mineralize the bones that support the skeleton, 30% is used for bones in the joints, and the remaining 10% is used in the metabolism of the liver and the structure of the epidermis."}, {"text": "works for me. Although it is orange...don't know why...but economical to use.  Dilute as suggested by producers and this becomes very economical to use."}, {"text": "Excellent!. product is affordable"}, {"text": "Now Foods, Lutein Esters, 20mg 120 softgels. when i take this one i feel relieved from my watery eyes...it's great product!!...i wanted to have more results so i'll continue taking it."}, {"text": "Seens like a good one.. I believe it is working? It isn't hurting me! The info on the bottle seems to indicate it is of good quality."}, {"text": "protein. very natural taste"}, {"text": "This is how you can easy make it stop dripping from the nozzle.. Remove the plastic from inside the nozzle, and there will be no problems with dripping. Ypu can remove the little piece of plastic very easy with the point of a knife or a fork."}, {"text": "taste is not great. not a great taste"}, {"text": "Great thickener!. I LOVE this product!!! I use it as a thickener in sauces, soup etc. Low calorie, low carb, high in fiber; perfect!"}, {"text": "My doctor recommended thses. My doctor said these were good for me to take as I only have half a thyroid gland"}, {"text": "Erez. Good quality and need with “DHEA”"}, {"text": "definitely worth to try. this may a little costy compared to other products but I would say this is  definitely worth to try if you are looking for green drink powder. I actually almost finished the first one and about to order new one with bigger size. The spoon inside the container was a little hard to find (i actually disrespectful notice for first few scoops and that's the only tiny thing I didn't like about this product."}, {"text": "Excellent!. Skin get smooth and bright after 3 weeks"}, {"text": "About this product.. good flavor. it seems to work"}, {"text": "Excellent!. Helps control blood glucose."}, {"text": "Excellent!. GoodGood product I have tried and happy with it. Will buy again and recommend to friends and family"}, {"text": "About this product.. Haven’t try out after receiving the goods..."}, {"text": "Clean sweetness. Less is more. Tastes great"}, {"text": "Taste great. We love this green drink, it has a slightly sweeter taste than plain magma due to some dehydrated fruit.  Drink it daily!"}, {"text": "Excellent!. The test is delicious and the results is excellent my Niels grows fast and become stronger"}, {"text": "Excellent!. I really liked the quality of this vitamin."}, {"text": "Good!!. It taste great as it's not so sweet when diluted with water. Also value for money."}, {"text": "Excellent!. I loved this super c, but I can't have more, because it discontinued."}, {"text": "good antiparasites but to be used with caution. Felt better after using it, tongue looks cleaner, fresh breath, better digestion... but not to be used often as it kills good bacteria too ."}, {"text": "Excellent source of plant protein. Really nice, nutty and natural. It has a bit of a green taste, so its not as versitile as some protein powders in some ways - but more so in others. You can sprinkle a little over salads, smoothie bowls, cereal - gives you healthy omega fats. Im really happy I purchased this"}, {"text": "Now Foods, Vitamin D-3 1000 IU, 180 Softgels. This was a great buy for the easy-to-follow Web site, low cost, speedy delivery, and excellent product. This was my first purchase, but definitely not my last.  I will continue to shop here."}, {"text": "A MUST FOR HEALTH/MULTI PURPOSE BEAUTY AID. THIS PRODUCT WORKS ON SO MANY LEVELS.  EVERYTHING FROM ESSENTIAL FATS(INTERNAL) TO BEAUTY AID (HAIR AND SCALP TREATMENT, MOISTURIZER) TO PET CARE (SHINY COATS WHEN ADDED TO THEIR FOOD).  I LOVE THE COCONUT TASTE AND THE PURITY OF THIS PRODUCT.  EXCELLENT PRICE FOR QUANTITY AND QUALITY."}, {"text": "Good sleep. Strong Product when you Take two"}, {"text": "About this product.. I'm not so sure about the quality of this product!"}, {"text": "About this product.. very good. Always purchase this product from iherb"}, {"text": "normally. was chosen for the complex supplement for the treatment of prostatitis dosage and a large number of capsules. But a lot of broken capsules, ie the shell is not sufficiently resistant to long-term delivery. switched to another manufacturer"}, {"text": "Excellent!. I take them every day to bolster immunity till vaccines available - no substitute I know but doing everything possible to keep healthy and strong these days..."}, {"text": "Excellent!. Really helps my sinuses"}, {"text": "Very Healing!. I had severe gastric reflux as a side effect of taking a prescription drug.  I quit the rx and the gastric reflux would not go away.  (I was done w/ prescriptions and was trying all sorts of natural remedies.)  Nothing worked except THIS!  I no longer take it regularly, but take it for flare ups.  Highly recommend it for both continuous use and as needed."}, {"text": "Excellent!. a good combo. easy to take."}, {"text": "Great for Energy, safe for kidneys. My husband has CKD IV and notoginseng was recommended for energy.  It works great... I have to remind him to slow down."}, {"text": "great. I love these seeds better than other hemp seeds I found on iherb. They have pleasant consistency. The package is good quality, still reseals tight after many uses."}, {"text": "Below average. Doesn't do anything. Don't recommend buying. Waste of money"}, {"text": "Excellent!. My won loves it!"}, {"text": "Usnea is the best for viral infections. Powerful stuff, this is a good formulation from Eclectic."}, {"text": "Excellent!. Great for hair, skin and nails. I notice a difference in the speed that my nails grow my hair is full and shiny too.\nUpvote if this was helpful"}, {"text": "Excellent. I highly recommend this product. It works really well. I have been healthier, no flu or cold either."}, {"text": "Excellent!. Very fast delivery and with expiration date of 4 yeras"}, {"text": "Good. product is affordable"}, {"text": "Great. Great flavor, mixes easily . I'd give a 5 star if it was from grass fed cows, fed NON GMO."}, {"text": "Excellent!. Everything is ok, but I don`t know why the color of the urine became yellow!"}, {"text": "Good. This great product helps me to eliminate my fatty liver, will recommend to my friends."}, {"text": "About this product.. My mother, who is going through menopause, has seen her mood improve since using this product. She also sleeps better at night and has less hot flashes. She used to take Estroven, but she prefers this!"}, {"text": "Good. Good product. And the delivery is fast."}, {"text": "Good. very very good reasonable price for what it supposed to do! i didnt see or feel much different but it seems like its working in the long term so its ok. minus 1 star because the pills itself are HUGE and hard to swallow. hurt my throat."}, {"text": "Excellent!. always taking this brand. love it"}, {"text": "Time will tell. I can't really tell if this is doing anything for me. Time will tell."}, {"text": "Excellent!. Excellent delivery"}, {"text": "Good. I would have given this product 5 stars, but it is very potent. I typically have to dump half the contents of the capsule to make it tolerable for myself. It detoxifies, and 'drys' you out, so drink quiet a bit of water with it."}, {"text": "Excellent!. Lielisks sastavs."}, {"text": "Excellent!. i love it .. very good next time for 3 for sure"}, {"text": "Excellent!. Good for my kids. They like the taste"}, {"text": "Awesome Product . Love it ..combine it with caffeine for both receptors"}, {"text": "LOVE this!. great product, great price"}, {"text": "It's excellent. The vitamins are very delicious and my little child likes them very much. I'll make an order again."}, {"text": "Arrived promptly. Arrived quickly!"}, {"text": "what a product. good product fast delivery will definitely buy it again"}, {"text": "Excellent!. like capsules vs drops\ncannot comment on absorption until I get a lab test  for levels \npleased that you can get these into Canada since some nutrition companies have had their 5000IU caps blocked by  customs ."}, {"text": "Excellent!. When I don’t use this product, I go back to being bloated and feel sick.  Love it."}, {"text": "Excellent!. A must have item in the shelves"}, {"text": "About this product.. It is very fading and hot. It is the most oil of oregano I have used. Its heat. Make sure to put some water with drops of it.\nIt is excellent for relieving sore throats"}, {"text": "Excellent!. Like the Fortify brand of probiotics."}, {"text": "Excellent!. Very good for boosting immunity"}, {"text": "Fast greens!. Great way to add your vitamin B every day!"}, {"text": "Excellent!. Health food, used blend with smoothie!"}, {"text": "Really big capsules. Great price, but the capsules are BIG."}, {"text": "This didn't work for me - anxiety and depression.. I didn't feel any difference in my mood after using it. I switched from a different brand and my anxiety returned pretty soon afterwards. So after several weeks, i just bought a different brand and my anxiety went away and my mood was better in a few days. It was pretty surprising because the other reviews of this were good, so I thought that this would work but for me, it didn't"}, {"text": "Excellent!. I use it when my kids starts having some cold symptoms specially cough, good quality and pure product without any nasties, fully recommend!!!"}, {"text": "VITAMIN C, 500MG, 100 TABLETS . I AM WORKING MYSELF UP TO A HIGHER DOSAGE THAN THE 500MG AND THE 500MG DOSAGE SEEMS TO BE WORKING ALRIGHT."}, {"text": "One Of The Best Folates. I did a lot of research on these, and this one is hands down the best for the price and results. Happy pregnancy and healthy baby."}, {"text": "New to me. The serving size is 6 capsules per day - you must take all 6 to get the full dosage.  I wish the product could be compressed to one or two capsules per day."}, {"text": "Muscle cramps . I use it to supplement my deficiency of magnesium.\nI am living in a hot climate and as I understand it can cause magnesium deficiency and muscle cramps.\n\nAfter a few days/week of taking this supplement I felt a significant relief.\n\nDidn't have any side effects with this product."}, {"text": "DHEA good hormone precursor . Naturopath recommended I take DHEA when I went off bio-identical hormones."}, {"text": "Great product. I have been buying this product for years. No horrible fillers. It helps to relax when taken before bed. I am not planning to stop taking it. I hope it won't ever get discontinued. I take two capsules twice a day. If I ever experience constipation, three capsules do the trick."}, {"text": "Easy to digest, small capsules. Compared to other brands, easy to digest (it's in capsules, not tablets) and the capsules are very small. Nice option from iHerb!"}, {"text": "Repeated purchase. Trying the bigger bottle as one bottle is easily used up a month. Tastes great and gives an energy boost for the day"}, {"text": "Good. Take 1 tablet together with vitamin C and beta-glucan to support bone and muscle. the tablet size is quite big but worth buying."}, {"text": "Good. Truely amazing it have two of the most important vitamins for the bones felt the difference \nHighly recommended"}, {"text": "About this product.. ExcellentExcellent goods item! very"}, {"text": "Great product. . Have been using for about 10 years..definitely helps with my stomach issues."}, {"text": "Doctor's Best Ubiquinol. A good quality ubiquinol taken for energy and immune system enhancement."}, {"text": "Needed Item. Great for a friend in need, when you have it delivered."}, {"text": "Imperative for a Healthy Immune System. EVERYONE should be taking NAC daily! I haven't had a cold or flu in as long as I can remember. Support your body with NAC. Take as recommended or just 1 per day if you find it causes constipation."}, {"text": "Nice . Product is effective. Recommended"}, {"text": "Anna. This product is very filling.  I drink some in the evening, throw in some frozen fruit in a blender for a very tasty smoothie.   No desire to eat high calorie snacks\nAnna"}, {"text": "Excellent!. First time to buy it. I hope it really works."}, {"text": "Amazing product, and then- NOT. I thought this is the most amazing product on iherb. After years of bloating and severe constipation, this product has literally took all my worries away.  I took it 1-2 times a day after meal and I had regular bowel movement It did wonders for two months and then nausea and severe stomach pain started, at night especially. So, I had to stop using it. So I'm back to constipation and bloating, but at least no pain."}, {"text": "Excellent and fast results. I was surprised by the result.  Breathing became easier and I feel it clears the nose.  The result takes place also fast.\n\nAs with all supplements, this review is based on my personal experience.  Hope it works for many others."}, {"text": "Love that oil!. It's a handy thing to have :) I use it my hair masks, on my face at night, on my lips during the day. I am happy with what I have in results. Happy shopping!"}, {"text": "21st century E-400 is good vitamin. Vitamin E-400 21st century is good especially for skin of women use one daily, pretty cheap."}, {"text": "Useful for anemia with low ferritin . Ferritin was very useful for my anemia, in just 2 or 3 weeks Ferritin level went up 4 folds!!!"}, {"text": "Carolyn C.. As always, IHerb does a fine job."}, {"text": "One of the best whey formulas around. Taste is ok. ON Gold Whey is one of the best quality Whey formulas around in terms of its ingredients. Reasonably priced as well. Taste is ok but not as good as their other flavours"}, {"text": "Excellent!. notice my stomach seems to feel better when  I take this."}, {"text": "At my age you need all the help you can get!. UC-II is the newest supplement, replaces all other joint repair supplements  like Glucosamine.\nOmega 369 - all I can say: I so much appreciate the fact that I don't have to drink fish oil anymore!"}, {"text": "brain health. I have read about the benefits of this fro brain health. I was hoping that t would help with tinnitus and visual snow. As yet, not results. But i will keep dosing to see if it helps in the long run. I trust this company's products"}, {"text": "Excellent as a glutathione booster. Take this continuously for more than 3 months and you will notice your skin brighter. I was taking glutathione but did not notice any effects. But when taken with this NAC, you will see the results faster."}, {"text": "Incredible Customer support. You guys have got to be the BEST in this world in Customer service!!  Thanks for everything!!\n\nGary Nycum"}, {"text": "Excellent!. All time favorite collagen! I already have baby hair after giving birth!??"}, {"text": "No title. It is a very practical pakige."}, {"text": "Excellent!. after drinking it i always poop so i think some toxins in my body are already washed out.??"}, {"text": "seems good. as with most vitamins, i can't really tell if its working but i'd say they did not cause any harm so far."}, {"text": "Good Pdt. Good. Keeps the flu virus away, well-protected. ??"}, {"text": "Excellent!. Very pleasant to the taste and good for a strong immune system. The children adore them."}, {"text": "Good. I think good. Yummy"}, {"text": "LOVE these!. Very Good treat!  Its crunchy and chewy at the same time. I highly recommend this product!"}, {"text": "Excellent!. good for support or increase yoyr immune"}, {"text": "Good material. Good package and quality"}, {"text": "Really good skin food. You'll get what you eat"}, {"text": "About this product.. I bought it for my mom abs she didn't like the smell, she still used it though, strong woman ;)"}, {"text": "Excellent!. My family likes it"}, {"text": "Excellent!. Kiddo likes the watermelon taste"}, {"text": "Excellent!. I really love how it tastes with very cold water it’s so refreshing although it’s a little bit too sweet"}, {"text": "Great For The Kidneys. Has help my wife with severe bloating and Kidney problems."}, {"text": "Excellent!. Gd product natural n effective"}, {"text": "Excellent!. Perfect choice"}, {"text": "Excellent!. sooth flu symdromes"}, {"text": "Very good product`. Helps me with my sleep!"}, {"text": "Rancid odor. Product has a very strong fishy and rancid odor"}, {"text": "Excellent!. Recommended to me by my Gut Health Specialist."}, {"text": "Great. Take this when you feel like a cold is coming on and you will feel a difference as the day goes on I just took one a day for a week as I felt I was getting sick and it help me from being sick with a cold"}, {"text": "Excellent!. Travel size lot for on the go... a must for daily wellness"}, {"text": "Excellent!. This is the best collagen I’ve tried so I will continue using  it  dissolves easily you can even put it in your morning coffee."}, {"text": "Good Formula. Use it for some years now and I can't complain, just good fomula"}, {"text": "Fresh. Good product, my only problem is that it is very hard to incorporate in cold drinks."}, {"text": "Excellent!. Better than other psyllium products I have bought. Mixes well and easy to drink once you get used to it."}, {"text": "About this product.. Great, and I recommend it."}, {"text": "The Best Vitamin B6 - supplement!. Wow!  Finally a high dose active form of vitamin B6.....  this is a complete game changer for me.  This was recommended by my doctor due to several genetic defects I have so it's extremely critical to have this product.  Furthermore, it's a huge benefit for men and keeping their manhood in great shape.  Love it and will continue to buy it.  Thanks Life Extension :)"}, {"text": "As good  as usual. As good as usual"}, {"text": "Excellent!. My husband loves the taste of these. \nThey are an easy way to get your Vitamin C in."}, {"text": "Excellent!. Very good way to prevent osteoporosis. It has the exact combination to keep your bones strong."}, {"text": "Love it.. I have used calm for years.  The sweet lemon flavour is very refreshing."}, {"text": "Excellent!. highly recommend"}, {"text": "Good Quality. A More Natural ALL Vegan NO Animal Sourced Ingredients and Affordable, DAILY."}, {"text": "very good product. very good product"}, {"text": "About this product.. Odor it regularly. I was looking for enzymes to relieve  tympanites and found it! It is the best for its cost. Like the taste and affect (when taking it with each meal). Please press LIKE if that was helpful :)"}, {"text": "RE: Doesn't leave you smelly. I like this garlic supplement the best out of all.  It doesn't leave you smelling like garlic like some do."}, {"text": "Excellent!. Great Taste,  best price"}, {"text": "Excellent!. I use it for many years. In combination with other  supplements   and physiotherapy - my joints are in better condition. Can be active with almost no limitations. Recommended !"}, {"text": "Excellent!. It’s my first time ordered and tried. I ate one tablet per day only and can feel the effect. I was so refreshing and making me more active than earlier days."}, {"text": "Best Quality, Price and Taste for a Protein Shake. My husband wanted a cleaner version of protein powders to supplement his fitness plan and so far, he has become a big fan of the BioChem Whey Protein Chocolate. We always have to have it in stock at our house."}, {"text": "Good . a good product. I will take more"}, {"text": "Wonder for Kidney Stones. Hubby had kidney stone pain for 9 days prior to taking this. After taking it as instructed, He passed at least 10-12 stones 3 days later. This is a wonder drug!  It works!"}, {"text": "Excellent!. D-mannose keeps my UTI away! Excellent product, without D-mannose I would have to take antibiotics more often. Absolutely love it!"}, {"text": "Excellent!. it's a must in every families medicine cabinet especially if you are into gentle remedies. this one is easy for kids. I'll give them 5 small pills and it keeps the nose clear and the flu away"}, {"text": "Great for hair growth. This is one of the most necessary elements for a long healthy hair (along with other perks). I started to take it exactly for this purpose, and noticed, that my hair started growing a bit faster. Probably might help if you want to \"break the barrier\" of some certain length :)"}, {"text": "About this product.. best iron supplement. no side effects\n very easy to digest and really effective at the same time"}, {"text": "Excellent!. I bought it for me but my kids \"stole\" them and use them for themselves! Loved the flavor too"}, {"text": "Excellent!. Really great stuff!!! Very healthy and has nice to taste. Better than multi vitamines!"}, {"text": "Excellent!. This bottle is value for money, really worth it, not that bulky."}, {"text": "Lowers homocysteine. Most bio-available form of folic acid; this is most economical price.  This product is what brought me to iherb 5 years ago.  Their great prices, fast shipping, and great customer service have kept me here."}, {"text": "Good. Love it with blueberry."}, {"text": "Tasty. Of course you cannot compare the taste with ordinary cookies, but for me who is now on keto diet, the taste of the cookie's is somehow tasty (from my point of view), not too sweet, and the texture is quite soft. I think I am going to re-order this again when I've finished the whole box. Ideal for snack purpose."}, {"text": "Excellent!. Dirnaqlarim mohkemlendi"}, {"text": "trying. have just bought this to try.  it is not about a month.  i see that my nails is growing.  let see in  a few months times."}, {"text": "Good . Good for my stomach blows up"}, {"text": "Nice vitamins. My skin and hair got better!"}, {"text": "Excellent!. I have not had a cold or been sick since I started taking zinc."}, {"text": "Good. This is good if you don't get enough fibre in your diet."}, {"text": "Refreshing Drink. I am on a low carb diet hence fruit intake is very very limited. Whenever I am craving for a refreshing fruity drink, i just mix this with a little monkfruit sweetener + ice and voila!  Citrus drink sans carbs.  Also heard you can use vit c powders for your skincare but i need to do a little more research on that.  Anyway,  this is nice to have around.  Very multi purpose."}, {"text": "Huge!. Bought this package for my parents and they loves it"}, {"text": "About this product.. Good for health!"}, {"text": "Awesome. Very recommended. You can use this for so many things. So healthy, great stuff."}, {"text": "Love This. One morning I woke up with a sore throat so I decided to start taking this.  My throat wasn’t as sore after taking it and went away after a few days."}, {"text": "Not working. Tried one bottle, no good results for me"}, {"text": "Product review. Taste was delicious and overall delivery service was satisfying but the custom clearance was disappointed."}, {"text": "was great.... was what i wanted..thank you"}, {"text": "Beste Multivitamin. Meine Tochter liebt es. Ich habe sovieles ausprobiert aber es half nicht. Seit meine Tochter das jedoch trinkt isst sie mehr und hat viel apetit.  Seitdem bestelle ich es regelmäßig. \r\n\r\nThe best Multivitamin on the Market!!"}, {"text": "About this product.. I think it works ?"}, {"text": "As described. I have no idea if it works but it is flavorless- slightly sweet. Mixes good. Lots of servings for your money."}, {"text": "Must have!. I think it's a must-have product for every guy that does a little sport."}, {"text": "Excellent!. I've been taking for several years now.  I take one tablespoon in the a.m. and one in the p.m.\nExcellent taste.  I have joint issues and found this helped me over time."}, {"text": "Great supplement!. I take this supplement each day along with the Doctor's Best 300mg Alpha Lipoic Acid supplement as it helps me to keep my blood sugars in check along with my diet and exercise.  I would recommend this supplement if your primary care physician approves!"}, {"text": "Pantothenic acid. Good support for adrenals. Was prescribed by FM doctor, take one capsule once a day."}, {"text": "Resolved recurring yeast infections. I struggled with recurring yeast infections for nearly a year. I tried everything - and this helped me finally feel \"normal\" throughout my cycle. Combined this with healthy, high fiber low sugar diet and it worked well. Will definitely keep it in my routine."}, {"text": "Good. They seem similar to other magnesium supplements I have taken, but are a slightly larger tablet to swallow."}, {"text": "Don't know yet!. I haven't had any blood work done to know if my liver enzymes are okay or not since I started taking this will let you know later."}, {"text": "More Mocha than chocolate. These bars are very good, but they do have a slight mocha flavour that I wasn't expecting.  Not as delicious as the Peanut Butter Fudge and the S'mores, but still very good."}, {"text": "Good value. I wanted a B-6 that was P-5'-P.  I have really noticed a difference since switching to  the P-5-P type.  Good price"}, {"text": "Doctor's Best veggie D3 works. Doctor suggested I take D3 since I am D3 deficiency and after taking for a month, I noticed my nails texture improved."}, {"text": "good stuff. This really helps with clearing up eyes that tear from allergies"}, {"text": "Mrs. Abakumov. Love this product for blood sugar balance as it has Chromium in three different forms and is essential for diabetes support as Diabetes is also a chromium deficiency ."}, {"text": "Great for detoxification. I got this to detoxify my system from the chemicals in my environment. I think it is working, I am feeling better"}, {"text": "Now Vitamin D-3. Sure beats laying out in the sun on a blustery, snowy day and the price is not bad either!"}, {"text": "Excellent Taurine. Great for sport - helps with cramps and mental focus."}, {"text": "great taste. good taste my son love it"}, {"text": "Great product. Excellent  product. Easy to swallow without any after effects. Great price."}, {"text": "Be careful!. I have never received the product"}, {"text": "Good!. It  is   good  tablets!"}, {"text": "Excellent!. Excellent and recommended product"}, {"text": "About this product.. Weird after taste"}, {"text": "PB 8 . I believe that in order to have a better effect, people have to change probiotics once in a while. PB 8 was not my first choice of probiotics because I need at list 30-40 billions but unfortunately since I am not in the states right now, I did not have much of a choice. So I purchased PB 8. I had to take a few capsules at a time and it served the purpose. I think it's a good probiotic and I would buy it again if necessary."}, {"text": "Excellent formula! . One of the best B complex formulas. Worth every penny"}, {"text": "Excellent!. My husband says these are gentle on his stomach and he feels great!"}, {"text": "Great product. I have had a bad knee that I have had to use a brace for during any exercise and a back that hurt every morning and within 3 days of taking the Collagen I felt so much better that I didn't need my brace and was able to stop seeing the Chiropractor."}, {"text": "Good. Very good supplement. It serves its purpose as vitamin E which helps our body."}, {"text": "Taste Good.. The taste is quite great, a little bit too sweet for me.."}, {"text": "Love it!. Excellent product. at a great price. It's hard to find US harvested spirulina."}, {"text": "Excellent!. I take the powder bone broth collagen and I take the pills when I travel. The pills are easier if you are on the go. I really enjoy Dr. Axe products. You should check out his videos. I have learned a lot!"}, {"text": "Good. Received it good .. the taste good"}, {"text": "Excellent organic chlorophyll. Excellent packing, the order came within a week. I am familiar with liquid chlorophyll- it is very good."}, {"text": "Excellent!. Bought this to supplement for my older children. Works well."}, {"text": "Great value for money. it takes a few to get used to the taste, but after that  I liked it.\nreordered 2 more"}, {"text": "Purchase review. According to the estimated time of arrival, very good business"}, {"text": "Excellent!. i took it a couple days in a row and actually saw a difference in my body! it did make me use the bathroom in the night but upon waking up i could really see the difference! highly recommended!"}, {"text": "can be used in multiple ways. lovrly in salad dressings"}, {"text": "About this product.. The taste is good"}, {"text": "Sweat a lot!. I used it during my body combat exercise and I did sweat a lot more than usual!"}, {"text": "Great for joint problems!. I have been using this product for several years to address the joint problems of advancing age. It helps to keep me flexible."}, {"text": "Excellent!. Great nutrition value"}, {"text": "Excellent!. Decided to try a soil based probiotic, good enough but I think the normal probiotics had a better effect."}, {"text": "nice. my baby like it, wish it works"}, {"text": "Excellent!. You were out of stock.  I was still able to get my order quickly & at bargain price thank you"}, {"text": "Excellent!. I have been using this product for a long time and am ready to leave my feedback! Every day, the whole family uses the products of this company. Best value for money == quality on the market! I advise everyone, you will not regret ordering. Everything is super :))"}, {"text": "Excellent!. Already bought 3 bottles. Excellent product , gives you a lot of energy!"}, {"text": "Excellent!. you can feel rejuvenated"}, {"text": "Good. We got these for my son who was having trouble sleeping. We saw that it helped calm him for him to get to sleep, but it is hard to say if he got a better night sleep overall."}, {"text": "Works well for me. It got rid of the extreme bloating I had after a meal.   My gallbladder has been removed and  this combination seems to help me."}, {"text": "Excellent!. Great product easy to take."}, {"text": "Very helpful. I have opted to come off prescription anti-depressants because of the side effects.  I take two 5HTP capsules at night and have found them to be of great benefit.  I sleep well and my mood is more stable.  I have been on them for about six months now and would definitely recommend trying them."}, {"text": "Good but too much . One of the best B-complex formulas but the high doses can be too stimulating . I have to open the capsule and take only half of the contents ."}, {"text": "About this product.. Ya'll weren't joking when ya'll said it's sooo good"}, {"text": "Seems good!. I’ve been using it for about a Month.  Don’t really know if it’s helping yet.  Taste is good.  Hopefully it helps keep me from getting sick!  Hopefully, it will make my immune system strong!"}, {"text": "notthing happen. notthing happen"}, {"text": "Good. Good product to boost your immune system! \nI think it helps me."}, {"text": "Excellent!. Wydaje mi sie, ze widze efekty w dniach kiedy biore ten produkt . Jestem bardziej skoncentrowana, szybciej mysle i mam taki „swiezy umysl”"}, {"text": "Not much difference in hair so far, but great skin and stronger nails!. I give this product a benefit of a doubt. I haven't noticed a big change in the amount of hair I lose every day, but the skin and nails look and feel much better. I might not have a problem of hairloss though, therefore I haven't noticed a change. I will get this again just to see how I respond when I take it for longer periods."}, {"text": "Probably Wouldn’t Purchase Again. Not sure whether it works but the smell is horrible as what other reviewers have mentioned."}, {"text": "Good. helped me with joints pain"}, {"text": "Excellent!. Great product and fast delivery.\nThanks!"}, {"text": "Very Good Vitamin!. Vitamins that my picky eater needs! And, it taste so good!  Thank you Child's Life!"}, {"text": "Works fine for me. Works fine for me"}, {"text": "Excellent!. best gainer taste there is"}, {"text": "Like It. I like it this product, I will buy it again"}, {"text": "Tastes ok. Our kid said it tasted good."}, {"text": "Great olives. Very good product"}, {"text": "Pure Essence, Ionic-Fizz Calcium Plus, Raspberry Lemonade Flavor, 15 oz.. Great balance of magnesium/calcium (we need more magnesium!) and tasty too- great price!"}, {"text": "Taste better than iron tablets and so far no issues with it. I had iron tablets before, they tasted awful. This one does not have the unpleasant taste, which is great. Did not find any issue with this product for so far."}, {"text": "Excellent!. My second jar of health! Very useful in our time!"}, {"text": "Worth trying. It seems really increase energy level.\r\nNeed to take longer to observe other possible results."}, {"text": "biogest. This product really works great digester and helps to go to bathroom as well."}, {"text": "Bad taste. Cant dissolve and bad taste. Heaters is much better ;/"}, {"text": "Excellent!. It is yammy. Easily way to take Vairamin C. \nGood product. I recommend it."}, {"text": "psyllium caps. good, cheap way of getting extra fiber"}, {"text": "Excellent!. Good price and effective \nA must bring item when i go travel"}, {"text": "Excellent!. I'm always ordering this product. Good quality from good brand."}, {"text": "Works very well!. Very good supplement. Finally I could grow my nails with it. Also noticed improved quality of my hair and skin. But the best effect is that my knees stopped making this terrible sound! \nWill purchase again."}, {"text": "Jury still out. Tastes great and I think it's a very good product but I need to finish it first to really notice the difference. I take it each morning in a big smoothie with lots of other stuff."}, {"text": "Excellent!. Love the flavour. Same delicious strong taste and good packaging"}, {"text": "Nice Food-based calcium. This seems so much much better than taking supplements made of bone, etc.  I love that this is raw and natural (and I'm not even a vegan)."}, {"text": "Good Product and Great Service. I take these daily and I like the natural relief it gave me. Also, the item was shipped quick. It arrived within three days, I'm not sure where it came from, but it was fast!! I'm happy with this brand of hops, and was happy with the service. Def. recommend."}, {"text": "Good. overall very good. taste is good energy is good but some of my orders the powder did not mix well, it looked like the powder is not absorbing any water."}, {"text": "Tasty chocolate protein, like cacao :) . Like it so much)"}, {"text": "Excellent!. IHerb is the best! Highly recommended. Genuine products. Fast delivery service good quality thank you."}, {"text": "tasty. Not too sweet I preferred Maple, nuts & Sea Salt"}, {"text": "Excellent!. Boron is amazing and in medical studies it increases free testosterone!"}, {"text": "Not So Sure. I had this and i feel really unwell after"}, {"text": "Excellent!. Bought it second time!"}, {"text": "Excellent!. i add tincture of nettle leaf on this and spray on my scalp on days when i need to have a good night sleep. it is very effective for me to get a deep sleep. this will definitely become my self-care staple."}, {"text": "Excellent!. I think this is a quality product. I use it whenever I overindulge in sweets!"}, {"text": "Good sleep promoter. The best OTC sleep promoter I've found.  It creates a relaxed, bemused state.  And it's cheaper than many other tinctures purporting to aid sleep."}, {"text": "When I was in Peru. I noticed how healthy the people looked and found the very poor their main food. WAS TURNIPS. They considered it Manna from Heaven - It gives you energy lots of it. I have been taking it for years. Always on the Gotta Order List .... SUPER FOOD at a Low Cost. Five Stars aren't enough."}, {"text": "Awesome for warding off colds!. I don't normally take Vitamin C, but when I had a cold coming on, I took 2 tablets of these daily. My symptoms were only mild and I felt quite well during the whole thing. I think the extra vitamin C boost really helped ward it off!"}, {"text": "Great Afternoon Energy Boost!. Another home run. I love drinking this after lunch to make sure I don't hit a wall. Keeps me going strong the full afternoon with focus and drive!! It helps that the flavor is to die for!!"}, {"text": "Excellent!. Carnosyn is the best beta alanine"}, {"text": "Amazing . Heals cuts quickly and really minimises scars...will definitely buy again"}, {"text": "Great for soaking. These salts made for a relaxing bath."}, {"text": "Excellent!. I have more energy and my need to eat something sweet is gone."}, {"text": "Good. I'll try this all my order."}, {"text": "Excellent!. Great products! I love it!"}, {"text": "Excellent!. Good buy. This is very affordable. I used the vitamins before writing my review. it works like my other purchase. I take this vitamins together with my collagen which I also purchase from here."}, {"text": "GOOD STUFF FOR THE LADIES.. My mum, 56 years old, always complains of aching feet whenever we go for outings and lasting days after that too. And she had problems sitting feets tucked in too. Now,cycling the vitamins 5 days on and 2 days off,she said not only are the achings gone and she being able to sit tucked in, but everything from her eyesight to energy level are improved. So this stuff definitely works."}, {"text": "Sorry, but I have not received my order yet.. Sorry, but I have not received my order yet."}, {"text": "Excellent!. really great product,good for my keto recipe and good for health"}, {"text": "Good. Like ingredients and that it’s organic."}, {"text": "Love it. I don’t really feel any added flavor and the size is perfect for traveling."}, {"text": "Excellent Quality. I am always satisfied with Now Foods product. I am devoted customer."}, {"text": "Excellent!. I bought the 30caps before but when i found out that it was working with then i bought this 60tabs.."}, {"text": "About this product.. It works!!! As with all Vega products"}, {"text": "Best product!. A pleasure to deal with.  Great product for common colds."}, {"text": "optimum. muito bom recomendo"}, {"text": "Good product. Good product to use."}, {"text": "Absolutely great . This calcium works 100%. Me and my husband we both. we take it, and our dentist sees how the bone grows.  In half a year, my bone grew, I was able to put a dental implant. We are very happy with this calcium."}, {"text": "Great energy and focus boost!. Easy to swallow pill, felt a boost in energy and focus. Felt throughout the workout with no crash. 10/10!"}, {"text": "Carlsson D3 review. I and my wife read many recent medical articles and decided to increase daily D-vitamin intake from 10 µg to 50 µg. We live at about 60th north latitude. Here solar generated D-vitamin production is practically zero over 8 months of the year. \n\nWe have now used Carlson 50 µg D3-vitamin only about one week. We can not feel any clear health effects yet. We have not got any negative side effects."}, {"text": "Good. reasonable price"}, {"text": "Excellent!. Good value for money and great result."}, {"text": "As Good as Animal Pak but cheaper and way less pills. I have used animal pak for years and I made the switch to now adam and i haven't looked back. It gives me the energy and nutrition that I need to get through very physically hard days. P.S. to help with absorption use with bioperine."}, {"text": "Kids Multi. Kids like this one so much. Tasty great"}, {"text": "LactoBif Probiotics, 5 Billion CFU. LactoBif Probiotics, 5 Billion CFU - We take this before or after junk food ."}, {"text": "Excellent!. good on top of cereal"}, {"text": "About this product.. very happy!  love this product!  I always take it"}, {"text": "By far the best brand of bacopa i have tried. i've tried a few different brands of bacopa and have found this one to be superb..\r\n\r\ni'd also like to note that i am highly suspicious that the two reviews for this product claiming that the Paradise Herbs brand worked better than this brand are ficticious reviews..\r\n\r\ni have tried the Paradise Herbs brand and have found it to be absolutely worthless compared to Himalaya, for what it's worth"}, {"text": "Well priced for a quality supplement. I live in Canada and I really enjoy ordering from iherb.com. They ship fast, have competitive prices and a huge selection of popular brands."}, {"text": "Excellent!. good quality product"}, {"text": "Betaine Hydrochloride. good digestive product."}, {"text": "Diverse strains of probiotics.  . Great packaging with individual pop out capsules.  Diverse strains and high count.  Will buy again."}, {"text": "It works. . I have been taking this for 1 month now on alternate days. I noticed my hair are firmer and my skin condition feels better. in the past I used to have eczema outbreaks but now it rarely happens."}, {"text": "Could not use this. This product along with me taking Elavil for depression made me so depressed I could not take it"}, {"text": "Below average. gave me horrible acne"}, {"text": "powerful microbial. This product was recommended to me by my doctor for Lyme disease. He recommended that I use it in conjunction with Banderol. Together, these two products have done more for me than all of the lab created antibiotics that I have taken in the last 6 years.  It is now my 'go to' product to fight Chronic Lyme disease."}, {"text": "Best product!. Very good product - has an effect only after a month of intake. Skin benefits:\n- own, premature reduction of skin deformation / resp. skin aging /\n- increases skin hydration\n- keeps the skin hydrated and smooth\n- maintains skin tone\n- enhances and supports the synthesis of collagen and elastin\n- increases skin elasticity\n- ensures the healthy growth of skin cells\nI strongly recommend."}, {"text": "Excellent!. Excellent product. Will order again :)"}, {"text": "Important. An important supplement as all neocell supplements it is my 6 bottle"}, {"text": "Excellent!. good health for  support"}, {"text": "from Bratislava, Slovakia. I dont know yet I hope it will help to boost my immune system in next 2 months. Perfect price for that kind of quality and amount."}, {"text": "Excellent! 31-Strain probiotic blend and protecting probiotics from stomach acid. I've been looking for the probiotic that can protect probiotics from stomach acid and I got this! Feel so excited. Also, it has 31-Strain probiotic blend that fit our daily need. Don't hesitate to give it a try!"}, {"text": "Good. Helps with immunity. Tablet is slightly large to swallow but still acceptable"}, {"text": "Excellent!. super nice product! it helps my nail grow healthy n strong."}, {"text": "good and delicious . good and delicious especially the small chocolate pieces"}, {"text": "Great protein . It's amazing product! Easily dissolves in water, doesn't have sugar. It has bcaa, so you don't need to get them separately. I should get more of this."}, {"text": "Good. The taste is kinda herby, but it help easy to fall into sleep"}, {"text": "Excellent!. I love drinking this in the morning with almond milk, honey, vanilla, cacao powder and a dash of cinnamon!"}, {"text": "Good. It was the first trial .. small dropper but stays for long time .. works well ."}, {"text": "Gluthathione. Its not expensive but effective"}, {"text": "Best I've found. I like that it's a good dosage per gel, is the readily- available-to-the-body form of CoQ10, and has added absorbability.  Also, I've grown over time to trust Jarrow."}, {"text": "Excellent!. Testy flavor !!!!"}, {"text": "Constipation. I dont know why - i have the opposite effect compared to what others experienced. Instead of helping with elimination, i have the opposite effects. I ope this is temporary and will go away. Also, i noticed the high iron content. This is not good for me as i have hyperthyroid condition. Therefore i am only on 1 tab a day."}, {"text": "Excellent!. Good value of price!"}, {"text": "Excellent !. it tastes good. il order it agaiiiin"}, {"text": "Good . Good price good packaging and quick delivery"}, {"text": "Excellent!. A must have for aches and pains"}, {"text": "Excellent!. It makes me more stress resistant. I highly recommend this form of Magnesium, as stress nowadays is everywhere."}, {"text": "Excellent!. Great product. This is my nth time ordering."}, {"text": "Joy Carlton, RN. This is the one my doctor recommended I take."}, {"text": "no results :-( bad product. I found no results with this product. I was very disapointed in that. It also caused minor chest pains when first started taking the product and if taken before laying down. I would not recommend this product to anyone looking to enhance or firm their breast."}, {"text": "Ester C. Effective and does not irritate the stomach"}, {"text": "Not satisfied. Doesn't miss well in liquid...turns into something hard and undrinkable"}, {"text": "Good. Good buy it again!!"}, {"text": "Excellent!. Fast delivery and good price. Helps me to get more sleep, give me more confidence."}, {"text": "Excellent!. I have been taking this product for many years instead of prescribed anti colesterol medical tablets. this product has been controlling my colesterol for years."}, {"text": "About this product.. This is my fisrt shake blender bottle so I cannot compare with others. I got it to try protein shakes. You have to be careful closing it, sometimes it is tricky to close it tightly, so I had a few drops here and there when tried to shake again."}, {"text": "Seen improvement in my digestive system. Alot of Probiotics needs to be stored in the fridge and this one doesn't. So far have taken for 3 weeks, my digestive system is better than before."}, {"text": "skin and stuff. 'eh, no big deal. I have better results from \"Dr.s Best\" Hyalurlonic acid with collagen than I've had from this."}, {"text": "Also nothing. Just thinking negatively always"}, {"text": "Great!. Such great taste! Sometimes i eat it more than i should, that how good it tastes :))"}, {"text": "It's just okay. It does nothing for my daughter unfortunately. My daughter would normally wake up in the middle of the night, sometimes with nightmares, sometimes just randomly talking. It's not that expensive so maybe it would work on others, not just for my kid."}, {"text": "love it!!!. I love getting extra chlorophyll, and w/ chlorophyllin, and this is convenient to use at work, I take 3 dropperfulls daily. they did tests showing it prevents cancers too. read about it."}, {"text": "trying.... just started trying this Yin Power and will buy it again if it is effective on me. thx"}, {"text": "Good. This is just like orange taste and a little bit sour. Sometimes I add to drinks to make it more tasty."}, {"text": "Excellent!. Full Spectrum Vitamin K2 is important to take with Vitamin D and Calcium. Good price!"}, {"text": "Very Good . Special in term of price, quantity &quality"}, {"text": "Thyroid energy. Big pills. Next i try something whitout iodine. Nothing bad to say."}, {"text": "Excellent!. Great price and quality....easily to use in water it mixes well."}, {"text": "nice big bottle. taste a little bitter in the end but I like it"}, {"text": "bcaa. I received the product fastness and liked a lot it. Thanks a lot."}, {"text": "Excellent!. Great Tasting protein. Have been using it with milk and in smoothies. Mixes very well and no issues digesting."}, {"text": "arthritis. zeel has helped immensely with the pain in my knees from arthritis."}, {"text": "need this dosage. being Asian and on heavy iodine diet all my life, I need this dosage to keep my thyroid functioning at its peak, weight and belly fat is better managed"}, {"text": "Excellent!. Great product. Easy to use, I add it to my oatmeal and smoothies. tastes good and satisfying."}, {"text": "Nice taste no suger , soy protein is the main source , price not bad . This protein bar not too sweet, zero sugar , main source is Soy protein not Whey Protein Isolate, if you want some Whey Protein Isolate bar this may not best match for you\n\nmake sure to drink cup of water after eating\n\nEnjoy"}, {"text": "Excellent!. It helps me so much to stay calm! Great product, no side effects for me. When magnesium can't help, this product does the job! During exams or big stress is a must have in my opinion."}, {"text": "Good. Been taking these caps for two weeks and seem to be helping but l suspect l need at least a month for full effect to be seen"}, {"text": "Corn Silk. It's working as expected.  Gentle. Effective. Easy to swallow capsules. Will continue to order these. Thank you iHerb."}, {"text": "Good. Good quality with good price!"}, {"text": "Great product!. Fantastic DK2 supplement, I absolutely love Thorne products and so does my Naturopath. Completely odourless and tasteless so you can add it to any drink or food."}, {"text": "Excellent!. I have a B12 deficiency. And take B12, but with this supplement, I feel covered."}, {"text": "High Quality Vegan Protein. High Quality Vegan Protein, taste quite good, mixed not bad but not compared to whey stuff\n\"salty\" taste..."}, {"text": "Activated Charcoal. Wonderful for neutralising toxins.  I've used this when I got food poisoning.  I took 4 as soon as I realised I had the symptoms.  It's also a staple for anytime I drink alcohol.  Reduces or eliminates hangovers the next day."}, {"text": "Healthy. I use it to support liver during detox program.It works I think,cause my blood test shows good results,which means my liver cleans it well.\nNo after effect or something.Everything works as it should.Like I said,my blood draw test shows good figures."}, {"text": "GREAT PRODUCT!. Good source of iodine!"}, {"text": "Excellent!. I got this as a Try-it so I have paid only 20 HK dollars. Delicious but still a lot of calories per bar -make sure you read the label. :)"}, {"text": "Excellent!. I wish I could eat this every day. Tastes good, relatively lowcarb, but it made me crave more."}, {"text": "Love the taste. Excellent taste, great for smoothies, digests easily."}, {"text": "Excellent!. I have tried several vitamins even the chewable ones but my kids still does not like it. After switching to this, they loved it and prefers it. Will continue to order this. So far it is good.."}, {"text": "Not as good as others.. Not as good as others. Other brands are a stronger dose."}, {"text": "Excellent!. This is a great product containing most of what I need to help get my liver back in order after heavy drinking for years, I recommend it"}, {"text": "Excellent!. Great product, except it's a bit expensive"}, {"text": "Great. It's hard to find this combo and I was happy when I did!"}, {"text": "Definitely helps with immunity. Lots of studies have been done on Beta Glucans all over the world and the product lives up to the claims. Do some research and you'll see what the hype is about. I will purchase this again."}, {"text": "It Works. I have bought it for 3 times now and i think i will keep buying it whenever its on sale. I noticed improvement on my joints especially my shoulder."}, {"text": "Works Well. This is a great \"tummy ache\" solver.  When you get those  ache feelings following eating wrong food combos, dairy, gaseous foods, it just fixes you right up!"}, {"text": "Hot flash relief. Vitex has really helped me with my hot flashes and it helped with the moods often associated with hot flashes.  I feel more positive.  If I do get a hot flash, it is much lighter and over faster so Nature's Answer, Vitex Berry has been a wonderful product for me."}, {"text": "Really good for women. Really good for women"}, {"text": "Excellent!. Good vitamin d3 for daily use. K2 helps it absorb well. I’m drinking it during my pregnancy"}, {"text": "Excellent!. Helpful in immune support and speedy recovery whenever my parents have a cold."}, {"text": "Good. It does relieve  my mom's knee strain."}, {"text": "Excellent!. Fasting glucose levels are now almost in the normal range, it works really well"}, {"text": "Excellent!. Love it! The tastiest snack bar ever!"}, {"text": "About this product.. Helped iron levels"}, {"text": "Good product, great price.. Good product although it did take some brisk stirring to disslove but was expected because it is protein, after all."}, {"text": "Good. A good type of magnesium, makes me slightly dehydrated so i have to drink lots of water after taking it."}, {"text": "Good stuff. I had a leg vein crisis and decided to try this stuff following the mostly great reviews.  I went from painful hopping around with an ace bandage to an almost normal leg in about 2-3 weeks after taking 2 of these every night before bed.  I'm convinced they contributed significantly to me not needing surgery.\r\nI would say that if you have painful legs, these are certainly worth a try."}, {"text": "Excellent!. Love these. Great taste and definitely think they have helped my immune system. Highly recommend."}, {"text": "very satisfied. very good product and price"}, {"text": "Good. Just started a fortnight ago, but think it's making a difference in reducing the lines under my eyes!"}, {"text": "Excellent!. Fabulous product."}, {"text": "wonderful. excellent product"}, {"text": "Excellent!. these suplemens are great for such price"}, {"text": "spirulina powder. I have artheritis and this is Great for pain relief and more smooth joints. Daily use mixed with wheat grass and ginseng"}, {"text": "Nice. Good whey protein"}, {"text": "Pretty good. I really can't say too much bad about it because I wasn't really consistent in taking it. But overall I could tell a difference in body odor the days I did take it."}, {"text": "absorbtion ok. presumably ok blood test calcium level ok"}, {"text": "Selenomethionine! :-). I recommend this product! :-)"}, {"text": "Excellent!. product is affordable"}, {"text": "Great. My periods had stopped and when I started taking this started again and have now been regular again for four months, I take 20 drops, three times daily with vitex and yarrow. Great product."}, {"text": "Excellent!. great item. excellent delivery."}, {"text": "Good for digestion.. I have been taking them for few months now, not regularly, but at least twice a week. My stomach feels good on them."}, {"text": "Excellent!. The best tasting protein shake in my opinion!"}, {"text": "Good formula for deep sleep. Big package and Large and practical packaging for a good night's sleep."}, {"text": "Excellent!. Excellent maca powder. I'm adding this into my daily morning juice"}, {"text": "Job done . I take it with My \nQuinine  tonic water.. To build immune system up ! \nI recommend and it’s fair price"}, {"text": "About this product.. I didn’t feel any special affect"}, {"text": "Excellent!. It helps me with my Crohn's disease"}, {"text": "so-so. My mother is impressed with this product, me...not so much. She says it helps her with her joint pains."}, {"text": "Great product!. I really like this product. When I have got off of it in the past, I tended to be more apt to getting sick. So overall, I can definitely tell a difference."}, {"text": "About this product.. healthy and good for family"}, {"text": "Great. I've been taking this product for two months. It really works!"}, {"text": "Excellent!. buying for parents and they said its useful!"}, {"text": "Best Probiotic Out there. Love these probiotics,are very effective. Take 2-4 each morning with cup of tea and seem to wake me up and help me with whatever ale's me. 2 if evrything is fine and 4 if I feel cold or headache coming on. Works well for sinis problems also. Awesome,been using it for years. Even helps my dog with her bad breath. Just one for the dog does it."}, {"text": "About this product.. Cannot say I have noticed any significant results after the first jar"}, {"text": "Great regarding protein and price. Protein compound is high considering unit price. If you don't concern taste, this is good choice."}, {"text": "About this product.. A bit sweet for me but the taste is good and it’s really crunchy."}, {"text": "Now Foods, Psyllium Husk Powder, 24 oz (680 g). Nice fine texture is easily blended,Great results for a healthily functioning digestive system.I'm thankful to iHerb for offering this good product."}, {"text": "product works.  Helps with anxiety"}, {"text": "Acne management. Been taking this for 2 weeks (6 tabs/day x 10 days and reduced it to 4 tabs/day) now and i can see progress with my lower jaw acne breakout. I'm taking this with 50 mg of zinc once a day and at the same time, eliminating/ minimizing sugar and dairy intake. Tablet is a bit big and it was hard to swallow for the first few days but i got used to it. Take it after meal. Otherwise, you'll feel nauseous and mild diarrhea is real."}, {"text": "No flushing. I haven't noticed any flushing with these tablets, as would be expected."}, {"text": "Didn't wow me.. The taste is not the best, it's very chemical-like and very sweet. It contains zinc and vit C which are good to have in flu medication, but I think that there are far better out there. Plus it worries me a little bit that auto immune disease -sufferers shouldn't use them. I didn't notice that before ordering and now my husband can't use these."}, {"text": "About this product.. cant tell the difference"}, {"text": "the best antibiotic. Germs can never become resistant to silver.  It works quickly and potently with no side effects.  Can be used topically or internally for any number of issues related to bacteria, infection, or immune system.  And best of all, it's available at a reasonable price OTC without prescription.  I will never be without this product."}, {"text": "Excellent!. this is the best creatine in my life. Gives you Monsters power"}, {"text": "Candida Clear. I used to be a sugar-holic - thus I have Candidas and probably always will....but these CAndida Clear supplement keep my condition in check...."}, {"text": "Excellent!. I cannot eat red grapes due to the high sugar content, therefore I start taking reseratrol.  Since I have been taking this on a regular basis, I have not had a cold for over 13 months."}, {"text": "Vitamin C - Good anti-oxidant andd helps absorb Iron.. I was borne moderately anemic and Vitamin C helps one to absorb Iron besides being a great anti-oxidant on it's own. A can't go wrong product!!"}, {"text": "Great product. Great price and product."}, {"text": "Great Quality. Bought this package already 2nd time. Good price and amazing quality. Great for pudding, cereal and salads. Also add chia seeds when baking a bread."}, {"text": "About this product.. Mixed it with milk and iced coffee, no complaints!"}, {"text": "Great product. Highly recommended"}, {"text": "Didn't work. Didn't work for my mom. Just one tablet caused bloating, trapped gas and stomach pain for 2 days :("}, {"text": "Gentle fibers. These fibers don't give gas (unlike many other products).It keeps your bowels in great working condition! I really recommend it to anyone...."}, {"text": "Have found something that works for me. Definitely  helps with arthritic symptoms.  Although there is still discomfort movement is a lot better while on these. Don't need to take them every day but they only take a couple of days to help. Have recommended this to others"}, {"text": "Excellent!. im 44 now.my wringkle start occuring.so this item will be my continues order.will see whats the outcome after using it for 3month.will update u all again.after 2 mths of consume it i gain wgt.maybe bcoz at the same time i quit smoking."}, {"text": "Now Foods Whey Protein Isolate Natural Vanilla. I love this product! It's not loaded with sugar like other protein drinks. I like the fact that they use a natural sweetener, stevia. It mixes well and mixes well with other foods that I add this to."}, {"text": "Great way to get Vit. C. Ordered this on recommendation to be sure to have adequate amounts of Vit. C . The product is easy to take and has just about no taste whatsoever. I mix in just a bit of water and swallow down, then add a tad bit more water just to make sure I got it all. \r\nDelivery was quick also, and will order again when need be."}, {"text": "Excellent!. I have achieved great thick hair with this product and good nutrition."}, {"text": "Mk ultra. As i call it. If your doing Keto, this is a must have! I highly recommend this product! 1 a day and its priced really well. This company is great. Thank you."}, {"text": "Inhibit IL-6, IL-1, And EBV. It’s the most potent herb when it comes to inhibiting certain immune systems that cause fatigue and depression. It inhibits most herpes family virus and also strep."}, {"text": "Excellent!. Good product and excellent price compared to other similar products"}, {"text": "Did not feel a noticeable difference.... Brought product for my partner.  He did not notice any difference in energy levels etc. \nPerhaps a higher dosage may be required? ... which we will be trying :)\n(20mg) hopefully he notices a difference..."}, {"text": "Vivid Results. It works but am wondering if it still does in the long run, we’ll see then"}, {"text": "not really. it was bad choice"}, {"text": "About this product.. Personally it is the one I love most among all the favour in the brand. Good to have one in the afternoon after a half day hard work."}, {"text": "Excellent!. Been using this for years and have recommended to most of my friend and they also noticed a big improvement in their skin..For me it took care of my joints and bones as i am a runner...really love this product"}, {"text": "Great Vitamins, Great Service. Since taking these tablets have felt healthier in general, husband's arthritic hands are definitely less swollen.  I would definitely recommend"}, {"text": "Love this. Love this Collagen. Also the \"taste\""}, {"text": "Excellent!. Excellent product with high  effect"}, {"text": "Excellent!. price is affordable"}, {"text": "Excellent!. I’ve only been taking this for a short time, but they are making a difference."}, {"text": "Good. Fast delivery and good quality"}, {"text": "Good . a good product. I will take more"}, {"text": "Excellent!. Good amount of ingredient with time release , the only thing is a huge tablet not easy to swallow"}, {"text": "good $$. really good price"}, {"text": "Excellent!. It has good ingredients, price and taste. Need nothing more from my protein"}, {"text": "Good!. It is recommend that spices like cumin stored whole and used right after grinding. Some valuable compounds will evaporate shortly after the spice has been ground. The overall flavor of freshly ground cumin is typically more intense and with subtler complexities when compared to pre-ground cumin."}, {"text": "Happy costumer here. Trying to up my iron a bit as I feel I`m lacking some through a vegetarian diet. Not taking it daily though.\n\n\nThe more I get to know this company the more impressed I get with their products.\n\nKeep it up Garden of Life!"}, {"text": "Excellent!. Great wife hasn't opened it yet, and its taking up space on our shelf but I like how it looks!"}, {"text": "Very good . Working Very Well.  Fast Shipping"}, {"text": "Perfect Chocolate Flavor. Much less bitter than cacao powder of all price points I've tried before, so it requires less sweetener and has a wonderful chocolate-y flavor. I love combining it with sunflower seed butter, date syrup, vanilla, cinnamon, and a splash of almond milk as a filling for crepes."}, {"text": "A Great Ca-Mag Product. Food based; no refrigeration; take with or away from food.  It is especially great when traveling."}, {"text": "Excellent!. Been repurchasing it for billions times now! I have weak antibodies and suffers from autoimmune disorders. Not sure that it was cos of this, but I used to get constant cold & sickness almost every month which I haven’t gotten one yet ever since I included this into my diet."}, {"text": "About this product.. Really healthy good stuff. I heat it slowly, add some soliga honey and then some manitoba hemp protein powder. Makes a great power snack."}, {"text": "About this product.. Too big and you need to take 3 of them daily"}, {"text": "Excellent!. Good for overall health"}, {"text": "About this product.. I took k2 only to take it with Vitamin d3 as it helps absorb better amd safer recomended by Dr.Eric Berg(youtube)."}, {"text": "Excellent!. Didnt taste different from the double chocolate, but results are ultimate"}, {"text": "Excellent!. very powerful pre workout love it."}, {"text": "Excellent!. Great product!"}, {"text": "Nice. Very nice, good taste."}, {"text": "Excellent!. good product that really works"}, {"text": "Good results. I notice definite improvement in hip joint discomfort."}, {"text": "Good. Didnt try it yet but heard good reviews"}, {"text": "Many uses.... Not only does the Source Naturals Phase 3 Carbohydrate Blocker help with some weight loss, but most importantly for me is that it helps keep my blood sugar in check it i over do it on my carbs.  Another great benefit is that it helps keep you \"regular\" by having more bowel movements.  They are not crampy or diarrhea type bm's they are just more often.  Which definitely helps of course to remove toxins from your body.."}, {"text": "My daughter love the taste!. Been looking for a chewable for my 3 year old daughter. Everytime I give one, she tastes it, and that's it. However, with the Alive! chewables, she keeps on asking for it that I needed to hide it after giving her one. Will order another for sure once this runs out."}, {"text": "amazing, taste is great. got this for my grandmother, she loves it. tastes great!"}, {"text": "100% the best products and the best price.It's amazing ,,It's amazing 100% the best products and the best price.It's amazing ,,It's amazing. 100% the best products and the best price.It's amazing ,,It's amazing\n100% the best products and the best price.It's amazing ,,It's amazing"}, {"text": "Good immune supplement. Too early to tell is it beneficial but it has all the basics vitamins and minerals to support our immune system. A bit smelly but it doesn't bother much."}, {"text": "Excellent!. I like this collagen from California Gold Nutrition, it’s work!"}, {"text": "Success with Mastic Gum. Great product, started this about 6 weeks ago and have noticed alot of improvement in gastritis and GERD symptoms, am able to eat some meat once again after not being able to eat meat without pain. Getting better every day."}, {"text": "Excellent !. good product, affordable price"}, {"text": "Below average. Compared to Nature's Way for probiotics for kids, this was sub par. Tablets are large and didn't seem very effective for my kid."}, {"text": "Very good!. Didn't have a migrane since I use it regullary:)"}, {"text": "Mrs. Abakumov. Love this product iodine is so important for health , and as a healthy cook I like to use a salt that is good for you with added herbs and Kelp , you tend too not over salt your food as there are herbs  added that flavour your food."}, {"text": "Excellent!. I think this is more efficient than biocell collagen in terms of joint relief."}, {"text": "Best of the lot. I like this one (of the Effer-C's) best since there is no fructose. Instead it uses stevia, a far better choice. Tastes really good."}, {"text": "From Lithuania. Use it on the skin. It calms my husbands psoriasis and does wonders on my skins problems."}, {"text": "Auri . Good for vascular, this chickpea product can help to get the mediterranean healthy life. I think every people need over 45-50 years. More effective for brain keep from cerebral haemorhage."}, {"text": "Great Vitamin. My overall health is better with Alpha Lipoic Acid."}, {"text": "Seems to be working.  I take this, along with Alpha Lipoic Acid, for blood sugar and neuropathy. Between the 2 of them, they seem to be helping, somewhat, with both problems."}, {"text": "Too improved a lot. Compare with my last purchase 2 years ago, quality has improved a lot. Honey textured are much better,"}, {"text": "Enjoying the deeper flavour. . Not sure how it would taste in hot drinks, but enjoy the flavour for baking!"}, {"text": "Excellent!. it is my favorit vitamin d3"}, {"text": "well.... i didnt realize it was so hot ,burned my tummy a few times even though i ate food with it.overall i know its good for ya."}, {"text": "Good. It is really hard to find a B Complex that I can take without having stomach problems. This B Complex has no side effects or allergic reactions when I take them. I rely on this company for quality and cost effectiveness."}, {"text": "Burning Sensation . This product arrived yesterday with a bottle of odourless garlic.  Followed the instructions to take 2 capsules of each and within 20 mins I could feel a heat brewing in my belly and 3 hours later I had diarrhoea with a spicy and fiery aftermath which you could guess where it was.\n\nTaken 1 capsule today and see if 2 was too much for me.  Will update again soon."}, {"text": "It Helps. My mother stopped using all the medications that she used to take after using this product. She's finally has calm stomach"}, {"text": "Excellent!. Good for liver support"}, {"text": "Kids. Good for kids at these days"}, {"text": "I hope it works ! :D. My doctor advised me to take this vitamins (folic acid 800mcg). Once I couldn't find it in Ukraine so I ordered it from ihearb. I hope it works!"}, {"text": "Great quality. Smells and tastes like its straight from the garden. Love it on its own or mixed with other less delicious herbs. The packet was giant, which is great cos Im making my way through it steadily."}, {"text": "works great!. take two daily, maybe three at first use\ntwo a day work great for me. also use stool softener (two caps).  wake up, doo doo and go on with your day. no stomach ache, minor cramps"}, {"text": "Liver detoxifer. Did not notice anything, took the whole boxs."}, {"text": "Excellent!. Use this product putting into mouth before going to bed, will protect your gum and tooth decay meaning it can keep your brain healthy."}, {"text": "Clumsy. Felt Restless Less N Clumsy N Fear Of Dizzy With Dowsy I Took Only Quarter Vit B6"}, {"text": "Excellent!. I take this internally in the mornings with water or juice. I also add it in my facial oil and body lotion. I add a drop or a few on my hands and brush it through my hair for some shine."}, {"text": "It works.. I got this for my mother and she is amazed how much it helps her eye problem."}, {"text": "Excellent!. great quality and value for money"}, {"text": "Efficient, Not Vegan Or Eco. Im not vegan myself, so dont mind gelatine in content. Happy with the effect of the product, it helps me regulate the digestion and colonic system while keeping a diet. The capsule is tiny and really easy to swallow. The carton is waaay to big for a blister though, not that eco, i would say."}, {"text": "Citrulline Malate is one of if not the best NO producer. Done a lot of research and Cit Mal seems to be best at NO production increase, better than straight Arginine. The stock seems very limited or very popular since it went out of stock almost as soon as it got restocked. \r\n\r\nWill update after about a month of use, hoping for good results. Great price though so 5 star for now!"}, {"text": "Below average. This product does not work for me."}, {"text": "Excellent!. I like this product and trademark. Recomend"}, {"text": "Unknown . Trying one more bottle"}, {"text": "Excellent!. YES i love this and other Gummiology gummies."}, {"text": "Good. I have only tried these once but I think it somewhat works. I feel more relaxed. It helps nicely if you have problems with anxiety, etc."}, {"text": "Bad smell, didn’t even give to my kids. I bought 2 of these for my kids & they both smelled rancid. IHerb refunded me, it was kind of a pain though as I had to provide photos etc."}, {"text": "Good. good and flavourless"}, {"text": "help us so much,thank bio gaia its a  very good product.  help us so much,thank bio gaia its a  very good product"}, {"text": "Really good price!. switching over to this brand because of the price. Much cheaper than purchasing Vit C effervescent tablet"}, {"text": "Good . Good product with reasonable price"}, {"text": "About this product.. Not very vanilla."}, {"text": "It works very well!!. It is being a big difference  with the tablets or without them. I really recomend these pills!!!"}, {"text": "Good. Very good price"}, {"text": "Excellent!. Must have to boost your energy"}, {"text": "Love It. Easy to swallow, prefer over drops, thank you iHerb for an amazing variety and great prices! And fantastic shipping to Australia"}, {"text": "Now Foods,Buffered C-Complex Powder, 8 oz (227 g). By far the best formulation of calcium ascorbate form of vitamin C in a supplement."}, {"text": "Not for me. I bought it....then I read it contains water from the Great Lakes. Eek! Pollution! When it arrived, I threw it in the bin. I didn't even open the packet/bottle."}, {"text": "Excellent!. Nice and small capsules. I can't tell if it is effective at this point but happy to continue taking it."}, {"text": "Excellent!. My daughter’s favorite vitamins. Very tasty and really helps enrich the body with microelements. Natural and organic. Definitely the best"}, {"text": "Good. I like this brand"}, {"text": "Good. product is affordable"}, {"text": "Excellent!. Good for regulating heartbeat, and moods."}, {"text": "Excellent!. Was not sure how import process would work. Overall impressed with how smooth it was. Thanks"}, {"text": "Excellent!. Not bad for vegan"}, {"text": "Excellent!. A sprint for body energy, and a muscle support great!"}, {"text": "Excellent!. Seem working well on my boy"}, {"text": "Nutriocolgy Pancreas glandular Lamb. great for digestion"}, {"text": "tasty!. it is tasty! I re-bought!"}, {"text": "Excellent!. Easy to take gel caps."}, {"text": "good product. . help me with digesting fatty food."}, {"text": "Gives me energy. I have used this in the past and it seems to work if you really watch you diet. But you can loose weight anyway if you watch your diet. It's not a miracle product, it just helps a little. After a few weeks of taking this I can say that it gives me energy!!!\r\nClick on my username for more reviews"}, {"text": "It works. I would recommend"}, {"text": "Excellent!. It doesn't just taste good but it smells good as well"}, {"text": "Good. Recommended by friends"}, {"text": "Excellent!. I love these eye drops, they're very tingly"}, {"text": "Chewable calcium. I like it... Mocha flavor"}, {"text": "Diabetes Help. After reading about glutathione and the benefits of helping with insulin sensitivity I decided to give it a try. I have been taking the glutathione for about 8 days. I have already seen a small drop in my fasting blood sugar. I am hopeful that the glutathione will be a good fit for me! I’m excited to see what my A1C will be in June! Thank you iHerb!"}, {"text": "About this product.. I plan to eat it consistently."}, {"text": "Black seed oil. one of my fave supplement. taste like gasoline but helps with strengthening immune and calming effect. recommend this to my family"}, {"text": "Magnesium. Excellent product"}, {"text": "Produto muito bom. Produto chegou em perfeita condições"}, {"text": "Excellent!. Good quality products, affordable price. I love this product.  Fast delivery even if it's delivered to another continent."}, {"text": "Excellent!. Easy to digest."}, {"text": "good. really nice quality product"}, {"text": "muscle pain. Can tell a difference in less than a month in muscle & joint pain."}, {"text": "Good. Pleasant taste and conveniently packed for travelling. Wished they sold these individually packed sachets in bulk for cheaper price for convenience."}, {"text": "best product. Very good for all body"}, {"text": "Not satisfied. I believe it works for SIBO, but seems to be damaging to male fertility, so make sure you know if it is relevant for you."}, {"text": "Excellent- A must Try. This oil taste great!!! I use it to fry, and instead of butter, it adds a flavor to the food that makes it extra delicious"}, {"text": "About this product.. great product,  good improvement on skin."}, {"text": "Excellent! Feel great at first fizz!. My first few bottle were gifts from a wonderful friend. After that, I buy them as gifts too. This Airborne Vit C is not like anything else - the formal a works and helps you maintain a good health and fight against regular seasonal ailments like cold/flu. It’s not a miracle tablet but has a very good source of essential vitamins needed for our lifestyle and today’s challenging times."}, {"text": "Good. Great product ... happy with this"}, {"text": "Trustworthy brand. Trustworthy brand"}, {"text": "love it. Really tasty and high protein too! Definitely my go to snack from now on."}, {"text": "hip's be gone. i started this product a couple of weeks ago and the inches are starting to come off. i have tryed almost every other product to help the over weight 40 blues and this seems to be working where as the others didn't"}, {"text": "Excellent!. Just great, the taste is amazing and the recovery help is on point wish they made a larger amount of it."}, {"text": "Excellent!. Great product all powder raw organic veggies and fruits with the best price here at iHerb.com and chocolate flavor"}, {"text": "Excellent!. I am just about pain free and am so happy with this Herb.  I got my life back and highly recommend this amazing product."}, {"text": "Not effective. Can feel any difference. Not effective for me"}, {"text": "Excellent!. Good source of iron!"}, {"text": "Very good product. My hair seems to be falling out less since using this product."}, {"text": "Excellent!. Am sweating a lot more and my apetite is reduced"}, {"text": "Source Naturals, Zinc Lozenges, Peach-Raspberry,. Excellent Product!"}, {"text": "Excellent!. good for making diy product"}, {"text": "Excellent. Really working product!"}, {"text": "You Will Sleep Like A Baby.. The perfect solution for insomniacs. 1 sachet without water and you will fall asleep within 15 mins, 30 tops. You won't wake up feeling groggy whatsoever! It tastes like powdered sugar (berry flavoured) but I love it. It's only 10 sachets in a box so I use it as and when necessary (which is usually on alternate days.) \n\nAwesome sleeping supplement IMO!"}, {"text": "Excellent!. High dose of NAC. It helps boost your antioxidant in the body"}, {"text": "Easy Swallow and Weight loss. Yes easy to swallow. Taken during Malaysia MCO period and for sure need to have proper meal before consume it. I might notice some weight  loss for 5kg. Good"}, {"text": "Great product. Ever since my cats take this medicine daily, their poop looks way better and healthier than before"}, {"text": "Excellent product. Have been using for a couple years. Always delivered on time and in good condition. Would definitely recommend."}, {"text": "Wonderful for IBS. I have tried many products over the years and after reading the information on Heather's website I decided to give it a try.  I am so glad that I did.  For me, this is a product I wish I had found a long time ago. You do have to follow the instructions and find your \"dose,\" but being patient is well worth it.  If you are like so many people with digestive issues, the price of this item is certainly nothing compared to everything you have probably already tried..."}, {"text": "best liver supplement for price and effectives. I've ordered this several times.  Its much more effective than the overpriced liver support supplements they sell in Japan."}, {"text": "Excellent combination of minerals. These minerals are always very effective since these are most needed elements for the body. Along with this we need to taken vitamin C and that will fulfill our overall need of the day, in my opinion."}, {"text": "Excellent!. without this preparation you will not improve your immunity and the condition of your body"}, {"text": "Good. Fine... not really taking digestive enzymes anymore, it was for my pets and it did the job..."}, {"text": "Monster Pumps. 3 tabs before workout and 3 tabs before sleep with ZMA. i got the excellent muscularity and veins all over fore arms and biceps.\r\ndont think.. just go for it and combine with Creatine X3 for Extra Fuller Muscle Mass.\r\n\r\n6 weeks usage i gained about 12 lbs quality muscles"}, {"text": "Great!!. A great compliment to a poor diet."}, {"text": "SUPER BUTTER. The smell is awesome, the taste is the same. I keep it in the refrigerator, when I need it, I take the quantity I need and leave it on the table and it becomes liquid and suitable for application (as a mask for face/hair etc.)\r\nHaven't used it in cooking yet, but I am sure, it is absolutely perfect."}, {"text": "Excellent!. good product to use for long time. quality is good and  suit for many people"}, {"text": "Very impressive. I never write reviews on the things I order, but I have to today.. I am totally impressed with how quick you got my order ready to ship, and then quickly shipped it. I received my order in about a day and a half, from the time I ordered it...i am going to try to order all my supplements from Iherb,, Thank you, keep up the great work........"}, {"text": "Excellent!. Great covid 19 defense for immune system !"}, {"text": "Good. Good taste\nWaiting results!"}, {"text": "Dailys. For a big pill, this one is very easy to swallow."}, {"text": "Ester-C. easy on stomach"}, {"text": "Excellent!. A good brand and product"}, {"text": "Flush flush flush!. Great for a fatty tissue detox, avoid the flush by taking on a full stomach."}, {"text": "Good. wish the tablet size were smaller..."}, {"text": "Excellent!. My girl loves this"}, {"text": "Excellent!. IMMEDIATELY ALL PRODUCTS OF THE BRAND ARE VERY BEAUTIFUL"}, {"text": "Great service, fast delivery. Great service, fast delivery"}, {"text": "Excellent fiber supplement and food thickener. Glucomannan is a great source of fiber and as an added benefit thickens up drinks which gives it a better mouth feel. Think of a sweetened aloe vera drink with pulp in it for reference. Introduce new fiber into diet slowly as you could get bloating or gass from it"}, {"text": "About this product.. good for pet and human!!!"}, {"text": "Great for blood sugar balance!. I struggle with reactive hypoglycemia. This product is a lifesaver for me. I take it at every meal and it helps me avoid crashing right after meals."}, {"text": "Bien. A good isolate whey powder, easy to shake. No flavor no after taste."}, {"text": "Excellent!. Received very good results with this brand of 7 -Keto.  In combination with hard training, overall muscle tone became noticeably better."}, {"text": "Not a big fan of the taste but.... Exelent source of protein!  \r\nIt has a really strong taste of pea that for me it's hard to consume, so the next time I will buy a flavored one."}, {"text": "No Title. Your service has always good."}, {"text": "Excellent!. We add this supplement to our daily regime. Helpful."}, {"text": "Excellent!. nice supplement"}, {"text": "Good. Good for vitamin d sufficiency \nfeeling better for bones pain"}, {"text": "Vanilla is the best flavor ever . I really recommend. specially mixing with  milk"}, {"text": "Excellent!. I like being able to help myself have good health using nutrition instead of medications that can cause more harm than good."}, {"text": "About this product.. Sain toote väga kiiresti kätte, olen väga rahul :)"}, {"text": "Great for falling hair. Wonderful very effective product and extremely good delivery from iHerb. Within a week I got my product."}, {"text": "good product. Strength in training!!"}, {"text": "Excellent!. Taste's great and like that it has probiotics!"}, {"text": "Excellent!. Very nice, does the work"}, {"text": "nice. very nice and low price vitamin B complex"}, {"text": "Contains 40 mg of Glycine per serving. Beware, almost half of the ingredients of this supplement are Glycine (40 mg per serving) whereas papaïn, amylase, protease and papaya together (98 mg per serving) , which it didn't show on the web site."}, {"text": "Using it for cooking. Not the most familiar item for cooking, but a recipe I ran into required this. I may test this to substitute for gellatin."}, {"text": "High qulaity . Great combination of chelated minerals as recommended by many doctors to get the most benefit out of minerals and also chelated so the absorption will not be affected."}, {"text": "Good. I giver my boy one teaspoon a day, so far so good"}, {"text": "Alpha lipolic. Very good service, prompt delivery,thanks\r\nAmy"}, {"text": "Excellent!. I don't remember how many times I bought this product already. They do help my eyes. My eyes are not as dry after a whole day of computer work if I take it in the morning."}, {"text": "About this product.. The taste is too strong and too chemical. My children didn't want to drink it."}, {"text": "Excellent!. Always ordering them for my parents!"}, {"text": "No difference. I tried Natrol L-Arginine 3000 mg for one month,but it didn't work for me. I noticed no difference at all."}, {"text": "Excellent!. Good quality at a good price, no nasty fillers."}, {"text": "Hooray for Vegan Vites!. It is so wonderful to find a place that carries so many vegan vitamins. iHerb is the ONLY place I can get ALL my vegan vites at one time! Bless you, iHerb!"}, {"text": "Excellent!. Been using the NOW brand Sodium Ascorbate for about 3 years.  Excellent product.  Keeping me healthy in these interesting times we are living in."}, {"text": "Better then Tribulus for me. I have discovered this Maca from Now a few years ago, and I really felt it. And like the title says, I felt more effects then from Tribulus. I pop 1 capsule every night before I go to sleep. It is a cheap and good  alternative to a lot of test boosters. Worth for you to try."}, {"text": "Worth to buy!. The first time I tried this after other brands. The result was visible after 2 weeks, I followed the recommended dosage.  3 capsules each in morning and night. The skin tone is surprisingly improved, and the hair and nail is noticeable stronger.  The result is amazing, will continue with this product!"}, {"text": "Good. Good for people who stay indoors"}, {"text": "Havent tried yet. Havent tried yet"}, {"text": "Satisfactory . Satisfactory increment of fat loss if a good calorie-reduced diet is established"}, {"text": "Good iron. Doesn't cause me stomach upset and my head doesn't spin anymore. Make sure to take it with something that contains vitamin C for absorption. Don't take with dairy."}, {"text": "Looks like not original . Stomach pain after using this product. Smells different than original (from original website)"}, {"text": "Excellent!. The drug is excellent. I buy it not for the first time."}, {"text": "Fast delivery, well packed, and good value !!. Excellent product, really well priced and very good quality !!"}, {"text": "Excellent!. Great minerals although I'm not sure if they are inorganic/organic ones. But for beginners, I would recommend it."}, {"text": "Ordering The Next Bottle Right Now. I bought this for my boyfriend you can see the result within a month"}, {"text": "It's good. I do love this product , i bought it when it was on a an a  sale .\n\nThe taste is good ( i like sweet ) , but it's a bit hard to wash off the bottle after it."}, {"text": "My favourite. I have used this produckt during severala years and I'll need it as long I live."}, {"text": "Good. Seem to work, if taken regularly, no side effects, have been buying for years."}, {"text": "Great.. Quality and taste acceptable."}, {"text": "Excellent!. Improves my hemoglobin level"}, {"text": "Excellent!. Will buy again! :)"}, {"text": "Quick delivery. The delivery came in 4 days.  The softgels are tiny enough for my 6 year old could swallow."}, {"text": "Excellent!. Very effective and easy to be taken"}, {"text": "Excellent!. Easy to take, no taste. Even for kids it's ok,no artificial flavor"}, {"text": "Excellent!. Love it after Thai boxing! It heal!"}, {"text": "Excellent!. Basically all the extra micronutrients I need to add besides the diet. I sincerely recommend it."}, {"text": "Good. Definitely not the best tasting protein shake i had, so there's a little disappointment. However the macros are great, and how can one goes wrong with Quest nutrition."}, {"text": "Good. I felt I had more energy, but did on occasion, cause some sleep restlessness."}, {"text": "works. I take it because I have read that it helps with detoxing that it removes the toxins (herxheimer reaction) of detox. I take 3 when feeling the side effects of detox like headaches, nausea etc. It says on bottle it activates the enzymes to remove sulfites which Dr Morse (on youtube) says is one of the causes of illness."}, {"text": "About this product.. Not a fan of the taste, want more sweetness."}, {"text": "Excellent!. Helps so much with energy levels"}, {"text": "Good. I always have this in my bag just in case. Very very effective actually!"}, {"text": "Good. I bought this for my father and this has improved his digestion. The price is reasonable and the package is also great."}, {"text": "Live Stronger. Well known and plenty of information available about it uses. This is a good brand"}, {"text": "Excellent!. Very Good product!"}, {"text": "The taste is pretty strong. I gave two stars just because i couldn’t handle the taste, even i am asian and used to the taste of ginseng but still this is pretty strong stuff. I havent noticed a boost of energy either, so that’s why i stop taking it"}, {"text": "About this product.. i am not sure about the effectiveness but the pills are huge, i am ok with the size though"}, {"text": "Works great!. Does what it's supposed to do."}, {"text": "good for facial skin trouble. I take this everyday."}, {"text": "NOW Curcumin Phytosome. This product is good if you have inflammation, like arthritis in your knees."}, {"text": "Excellent!. Excellent product, help to increase vitamin d3 level."}, {"text": "Excellent!. I’ve only been using this for a couple or weeks but I feel that my hair is a bit stronger. I have a positive feeling that this could help my thin hair become a bit less weak if I keep up with taking the tablets."}, {"text": "Good product. These digestive enzymes are really good.  I had my gall bladder removed years ago and suffered with excessive wind and indigestion but since taking these enzymes I don't have the problem."}, {"text": "Good organic spirulina. Very interesting price for a daily use,but I appreciate from time to time Now Foods Organic Spirulina Powder for its taste."}, {"text": "Now Foods Ubiqionol 100 Mg. We have used other brands of Ubiquinol but find the \"easy-swallow\" 100 Mg Tablets from Now Foods excellent. We also feel that Ubiquinol is the most important suppliment that we use and would encourage all senior citizens to take them."}, {"text": "Excellent!. great price, good for the hands"}, {"text": "A staple in the medicine cabinet. I have used this for many years. A casino employee first recommended it as the best way to deal with second hand smoke. When I have a lingering cold or bronchitis, this is my go to formula."}, {"text": "Value for money. Good price\nEffectiveness\nFeel good to improve my eye health"}, {"text": "Great. It tastes good and I hope it delivers on what it promises."}, {"text": "Good. If you want a quality immune boost but do not want to take colostrum this just might be the supplement for you.  LE is a great company.  Price point seems right for this product."}, {"text": "CreaGains xD. at first I took a full tea spoon and got me diarrhea, so to fix this problem is to lower the dosage until it goes away so about 3 G is about good for me, it dissolves well in room temperature water with no residue left."}, {"text": "Good. I have purchased this product a few times and definitely will buy again."}, {"text": "Excellent!. Good products ever"}, {"text": "No flushing. Perfect for the husband for whom niacin is too much.  Good price."}, {"text": "I LOVE My CarbRite Bars & iherb.com. Thanks iherb.com for offering such a great price and speedy delivery of these carbrite bars!  My favourite bars and you offer number 1 services!  Thanks YOU!\r\n\r\nCarmen"}, {"text": "can reduce toilet time during sleep. can reduce toilet time during sleep, but no healing effect as all resume normal when stopping to take this"}, {"text": "Selenium. Just started taking this for help with thyroid - too soon to tell if it is helping.  No detrimental side effects or other negative reactions noted at this time."}, {"text": "Excellent!. This Supplement is working with the result happy to use and will purchase more as well"}, {"text": "Great product. Doing it's job...will come back for more."}, {"text": "Excellent!. I like this brand"}, {"text": "Excellent!. Only con is you have to take 4. But small and easy to swallow."}, {"text": "over rated. i did not find this product very good,i was not impressed.\r\n\r\n                                                                  thomas-england-uk"}, {"text": "Good. I believe this is a good product, i can only guess because my 6yo  only tried it once and then refused to drink it."}, {"text": "Up my chlid immune system. I used this for supplementing my child diet. it really helps him though with a healthy body for the last 2 months when he started taking. Excellent"}, {"text": "Just started using. Just starting using this product recommended by doctors, will see how it works out.  That said, do feel a boost in energy shortly after taking it, about an hour or so."}, {"text": "Doctor's Best Lutein. Lots of problems with floaters and old age eyes are not a problem any more since I started taking Floraglo lutien and zeaxanthin."}, {"text": "Quick delivery . It was my second time that I bought some vitamins. I am really satisfied with the service and logistics of the website.  Always keep this quality In the services."}, {"text": "Excellent!. As expected and fast delivery"}, {"text": "re: red yeast rice. excellent product"}, {"text": "Now Foods, Biotin 5,000 mcg, 60 Vcaps. Great price and helps with nail and hair growth."}, {"text": "Ridgecrest Herbals Liver Clean. Gut health, energy level, elimination process improved greatly"}, {"text": "Excellent!. always purchase this formula"}, {"text": "Very good & Useful. Very good & Useful"}, {"text": "Coconut oil. First try, no irritation on my eczema affected area."}, {"text": "This one is the best by far!. I am a CCN, and I have used this product for my own family, as well as my clients, since it has become available.  I so appreciate Iherbs product selection, their shipping and customer service are second to none.  Thanks for the great products and service!"}, {"text": "Clean, quality vitamins. . These are great prenatals that don’t hurt my stomach at all. The ingredients are high quality for a great price."}, {"text": "It is so bad. This product causes the stomach acid pain"}, {"text": "Good but price moved up. Really good, but I just can`t realize why the price went from 58,00 AED into 77,00 AED (+33% price increase), and I`ve purchasing this one since ages.  Also, never got an anwer from iHerb team..."}, {"text": "Great kidney and bladder support. I only want to use organic cranberry and this has been the best I have tried."}, {"text": "Excellent!. not sure if I saw any difference"}, {"text": "boron. Its OK until  blood test prove it has worked its hard to tell"}, {"text": "Good. Could be better. for some reason cannot say that it worked pretty good"}, {"text": "Very good. Husband puts this on his cereal.  The flavor is very palatable."}, {"text": "Very good and affordable. Good product, been taking it for a few weeks. So far so good"}, {"text": "IMHO the best C. I read about Ester C a few years ago and began purchasing and using it regularly. All my family of 6 here is also using it daily. Truthfully, in the last 3 years at least  no one has had even a small cold. I am sure the regularly use of high quality Vitamin C has something to do with this."}, {"text": "Excellent!. New purchase not try yet. Seems it’s very convenient  for green life."}, {"text": "Great Quality, Great Quantity. Can't beat the price for how many Omega-3's you get."}, {"text": "Excellent!. This is good for white hair!"}, {"text": "Excellent!. this product will super charge your immune system.  with todays environment you need it.  it will also help with repairing body damage because of age.  i have been using it for many years.  will make you feel young again."}, {"text": "bad smell. The product very bad smell"}, {"text": "after 2 months results. i start see results of this product 2 months later and i think these tablets do the job very goood for my hair and for my nails!!"}, {"text": "Excellent!. all natural pain relief at its best once again from the most renowned German homeopathic company called Medi Natura this product helps me to be completely pain-free and keeps my arthritis in check you can check it every day without any side effects or interactions it is preventative medicine at its best"}, {"text": "Excellent!. very good product"}, {"text": "Great!. Great product! Good taste."}, {"text": "standard.. I believe this maker."}, {"text": "Excellent!. kiddos love this"}, {"text": "Excellent!. Good taste, easy to take"}, {"text": "nadh. very good product"}, {"text": "Delicious Vitamin C. Delicious Vitamin C - all day health"}, {"text": "Excellent!. I've been using Zenwise digestive enzymes for several years - primarily to accompany plant-based meals, while using an HCL-Betaine digestive supplement for heftier meals. This is a high quality product that aids in digestion and I really like the unique ingredients that aren't in other digestive enzymes supplements, such as the sea vegetable complex. I find the capsules are easy to swallow and not too big."}, {"text": "Excellent!. my favorite honey"}, {"text": "Recommend!!. This is a great product, and take 1 tablet daily with any meal,so easy..\nI recommend this product to anyone who needs a good multivitamin for women."}, {"text": "Kre-Alkalyn EFX. waste of money :(\r\n\r\nI do not recommend!!!"}, {"text": "Hyland Leg Cramps with Quinine . I find that these pills help quite a bit. I used to get my quinine from tonic water, but the amount of quinine qite low.  The pills also easier to take when away from home."}, {"text": "Excellent!. Looove the crunchy texture \nGreat flavor, reminds me of rice crispy covered in caramel and chocolate covering"}, {"text": "Good product, I order it for the 2nd time. Good product, I order it for the 2nd time"}, {"text": "high in chlorophyll. I hate the taste but this one are in capsules makes easy to take and is micronized. The problem is, you are out of stock 3 weeks consecutives."}, {"text": "Excellent!. Very good product. Can see the effect the moment I took my 1st capsule when I was down with diarrhea. Strongly recommended product"}, {"text": "Grapefruit Seed Extract. Best product for yeast and candidia problems-- at least for me."}, {"text": "Works great. It’s the first thing that worked for me as my acid reflux is getting worse I really needed something"}, {"text": "About this product.. In my house the men loved it. Say the taste is great. Great way to get vitamins"}, {"text": "nuo persalimo. pirkau vyrui, nelabai apsaugojo nuo ligu, zymiau geriau kates nagas"}, {"text": "Good. I like the enteric costed tablets as it helps to prevent gut issues for me with 5-HTP."}, {"text": "Good. helpful for my mother's Alzheimer's ."}, {"text": "Not sure what to make of it.. This confused me. My expectation were that high fiber intake will help to regulate bowel \r\nand in process I may loose some weight.\r\nWhen I took this product I drank lots of water but I continued to be bloated and it did not\r\nhelp a lot with bowel movement."}, {"text": "Good. It improved my recovery and it helps with muscle soreness, I use it daily and the price isn't bad at all. The flavor wasn't the best starting out, but I got used to it after a few days. Great bit of energy."}, {"text": "Very nice . Very beautiful"}, {"text": "Excellent !. Good quality product. Works!"}, {"text": "Excellent!. wonderful, clean product."}, {"text": "Delicious. This is my all time favourite brand so far. Such a creamier consistency than all others I’ve tried. Delicious drizzled over frozen blueberries or by the spoonful!"}, {"text": "Innesah, London , England , UK.. This is  a really good formula and was purchased for a relative who has had a good healing from it. We have purchased other remedies  from this  company , all stocked at Iherb."}, {"text": "Very Good. My kids can tolerate this, and its full of the nutrients they need!"}, {"text": "Excellent!. Taste and texture is great, will order other flavours.\nA bit too many calories though"}, {"text": "Excellent!. Good for jet lag users!"}, {"text": "Excellent!. Best product. Great value. Very Effective"}, {"text": "Good. prodotto economico"}, {"text": "Excellent!. The BEST all the detox herbs in one capsule.\n\nMy grandfather from Crete picked these herbs and taught them to me many years ago.\nDANDELION=TARAXACUM is the Best"}, {"text": "Excellent!. I’m buying this replacing another brand purchased earlier. This is value for money. Will repeat my orders once finish."}, {"text": "Good value for money. The product includes Potency B complex. When feeling tired, I take per suggested serving size. No observable benefits so far. \n\nPrice is lower than similar products sold in Hong Kong. Take on a random basis to prevent reliance and overdoes of the supplement."}, {"text": "Excellent!. Good fo my skin i can see the glow on skin"}, {"text": "Angel Paws Rescue. Liq. Chlorophyll is one of the ingredients for a natural remedy for loose stool in cats/dogs.  World Organic is well - organic and made from quality grasses."}, {"text": "Below average. Below Average used only once after that dropped from our purchase"}, {"text": "Good. Just started taking them from this brand can’t really comment on effects yet but they came in perfect condition!"}, {"text": "Recommended. This was recommended by my doctor during my chemotherapy to protect my heart . 16 chemos behind me and 4 more to go and the ticker  is still going strong! I will definitely continue with this when the chemo is over. ( Age 67 )"}, {"text": "satisfied customer. good product and good price"}, {"text": "Excellent!. Great price for the quality. Great supplement for breastfeeding to minimise clogged ducts"}, {"text": "Great brand. Lovely smell for evening before bed"}, {"text": "Excellent!. Best taken in the morning. It supplements well with my stimulant medication. Get the 120 capsules for more value of your money spent!"}, {"text": "Alpha Lipoic Acid. I prefer this R factor to the synthetic A-L-C. I like the Doctor's Best products."}, {"text": "Amazing effects. Amazing product! I originally bought this for healing my damaged & dehydrated skin after a hives attack. But now I know what supplement to take for anti-aging relief! Plumps up and hydrates face completely, I would say takes off ~10 years of damage and age. Bought one for my mother and sister to try out as well!"}, {"text": "Works great. I have used it for years it works great!"}, {"text": "Good. Great taste I liked"}, {"text": "Excellent!. Very concentrated product"}, {"text": "Excellent!. The product is very good. Eat and feel good. Got satisfactory results, packaging is quite beautiful, quality."}, {"text": "Good. brought it for my family member \nthey said their nail is a bit stronger than before :)"}, {"text": "Not good for smoothies, might be ok for baking. Very gritty, even when blended with soymilk. Not great for a protein shake. Probably ok for making high-protein cookies or something."}, {"text": "Excellent!. This is also one of the items in the Dr. rinse formula.  I can get the powder lecithin here but the granules mix into the formula so much better."}, {"text": "No positive effect noticed. Doctor's Best is an OK brand in my opinion, and Ginkgo may work on some people, but I took this daily for a couple of weeks and observed no improvement in cognition, attention or memory. I expected this to help with my cold extremities as well and I felt no benefit in that respect. If anything, I felt a bit dizzy and slightly nauseous at the beginning when taking it, which made me wonder how come some people take it for vertigo."}, {"text": "Excellent!. It's a great item. That helps people to be more balanced with hormones."}, {"text": "Excellent!. Item arrived fast and family is happy and we just trying it so far so good !"}, {"text": "Seems like a good product. NOW products have been very reliable for me."}, {"text": "Inulin is good for gut health!. Inulin is good for gut health! I use it also to help yeast rise in Keto bread. It works very well. You can also use it in yoghurt or smoothies, it has a pleasant mild sweetness to it."}, {"text": "Good source of vegan protein. Good source of vegan protein... Just don't spill it on your clothes, a pain to get out."}, {"text": "About this product.. Taken for lymphodema but didn't notice any change unfortunately."}, {"text": "I like this formulation of magnesium. I take it to support sleep quality and overall health but like that it has brain health and memory benefits too."}, {"text": "It's quality. I have been using MSM for 10 years.  Most people with a true deficencey will have a wavey thumb nail.  It has taken me 10 years of MSM and my thumb nail is almost healed.  My mitral valve prolapse is much better with no more pains in my chest."}, {"text": "good product. I feel it does the job"}, {"text": "Excellent!. The best vitamins!"}, {"text": "Perfect. Perfect little pills, just one is enough each day"}, {"text": "Excellent!. excellent form of q10."}, {"text": "great!. not all formolas work for me,\nbut this one worked more then expected! 2 of this before going to bed and the sleep is amaizing.\ndont exepect it to be like sleeping pills, it relaxes you and makes you sleepy but doesnt knocks you out,\nfor me its a good thing...\nand complitly natural, finally pills that im not allergic to."}, {"text": "Excellent!. Great supplement. repeat customer here. We will order more. Transit is quiet long because of Covid 19. but its ok, packaging of iherb is super."}, {"text": "Favorite for Morning Smoothie. I found adding Super Seed to my morning smoothie, along with some green food powder, frozen berries, and any fresh fruit desired, enables me to start the day with all RAW living foods, minus the worry of low blood sugar effects (7g protein). It is gentle on the digestive system, contains no animal products, and you get the benefits of over 1000mg. Omega III fatty acids per serving."}, {"text": "Great product for high price. Great value. It's a good antioxidant, so I take it on an everyday basis. When I felt under the weather, I took a double dose and the next day felt myself absolutely healthy. Unfortunately, the price is high."}, {"text": "umac-core. im a healthy guy but i smoke, i haven't seen signifigant results except for one situation,,,,, i dont have that \"smokers cough\" in the morning smoking outside in -40, it may have increased my lungs and also my energy levels a bit, 2 bottles later,,,,, i'm going to order more!"}, {"text": "Good. Effective. Ingredients okay."}, {"text": "Great for your memory. Easy to swallow, very small tablets. Great for memory. Large package size: 250 tablets. Great value for money."}, {"text": "Excellent!. Best chocolate bars"}, {"text": "Excellent!. Got this on a promotional basis and realized it was one great deal. Imaging paying 99 cents for a bottle! One better thing though is that each tablet contains 1gm of Vit C, thereby lessening the inconvenience of taking 2 tabs which to a person taking numerous supplements means a lot. Got one for myself, another for my mother and some more for my family."}, {"text": "Excellent!. GOOD~~~~~~~~~~~~~"}, {"text": "Excellent!. It tastes very good and I feel better. My nails are stronger and I have more energy."}, {"text": "very good. i love it...my have more energy"}, {"text": "Super. Super satisfied with this product!!"}, {"text": "Excellent . Excellent taste.  It gives me a good buzz during my workout."}, {"text": "Excellent!. I use it to make desserts and drinks. Healthy and tasty"}, {"text": "Quality. Best quality!. When you read \"Bluebonnet\" on the label, that's enough for you to know that the best quality is there."}, {"text": "Excellent!. great in smoothies superfood helps build your immunity"}, {"text": "Excellent!. The best one forever. \nI use it for every and anything, and it really helped me."}, {"text": "Great. Great for the kids"}, {"text": "Excellent!. Great for maintaining blood sugar"}, {"text": "It works. .My kids like the taste of it, and I feel it works with them relieve the aspects of flu"}, {"text": "About this product.. Thank you for the fast delivery. I feel like I'm already feeling better. Thank you."}, {"text": "Cats & Dogs accepted. Received in good condition. For feeding pets I think powder will be better choice. Just mixed with their food. Good product ! The MUST supplements for pets!"}, {"text": "This product is a big help. I've suffered with migraines for 40 years.  At one point they were chronic.  Then I tried butterbur, and what a help it's been, especially in combination with prescribed drugs.  My migraine frequency is now quite manageable.  If you have migraines, give this a try."}, {"text": "Excellent!. The most effective digestive enzyme product. It is expensive but worth it."}, {"text": "Oops... No bioflavinoids, poor absorption and retention."}, {"text": "Excellent!. Nice flavor, build you up"}, {"text": "natrabio. Couldn't see that this worked for me.  Not much does."}, {"text": "Love it. Bought while on offer.  Can feel improvement to my body after taking this product.  Would not rate it 5* at current price."}, {"text": "Excellent!. Good product by a company with a great reputation. I like the fact that the dosage is 5000 iu. In Canada I have access to only 1000 iu and have to take 5 softgels. Good for your immune system."}, {"text": "heavy duty glass container. F.Y.I.  The container is made of glass, not plastic, which is nice but make it heavy,  will crush any metal cans with ease and it might break.  The cover is made of  plastic."}, {"text": "Good Protein But Taste Not So Good... It’s a good one for the price band, dissolve well with water or milk. Only drawback I find is it’s vanilla taste is not so good.. even till I finish whole bag I could not get used to it’s taste."}, {"text": "About this product.. takes getting used to, hope it does what they say it will"}, {"text": "About this product.. I cannot in good conscience recommend this. It is strangely soft for a cookie, not in the \"Subway\" kind of way, its just softtt and crumbles if you even look at it. Also has weird aftertaste, not totally unacceptable, just hard to accept as a cookie replacement."}, {"text": "POTENT but a bit too strong for me - - Schisandra Adrenal Complex, 710 mg, 120 Tablets. This is potent formula but seems too strong for me with the addition of other herbals - made me feel drowsy.  I switched to plain Schizandra from Nature's Way and this was my magic bullet.  Schizandra is a major Chinese herb with wonderful benefits for the endocrinal system as well as for the beauty of your skin.    I ENJOY REVIEWING ALL MY PURCHASES to help people MAKE WISE CHOICES."}, {"text": "About this product.. The quality is great ??"}, {"text": "About this product.. Was really good price. Not sure how they work."}, {"text": "Fibro Defense\nFibroid Defense. I have been taking this every time my period is about to come, and the in-between period as well. It eases the tenderness of my breast and stomach."}, {"text": "Excellent!. Very good ingredients, easy to use if you have iron deficit."}, {"text": "Great. No GI side effects, and my hemoglobin level raises up very quickly!"}, {"text": "Good quality product. This seems to be a good quality product at a great price."}, {"text": "Excellent!. If you want mucus relief, you should give this a try."}, {"text": "Excellent!. 100% pure L-lysine, good price, good size. No more ingredients. I use it every day twice with meal."}, {"text": "Excellent. Excellent Service.  Excellent Product.  Thanks !"}, {"text": "It's worth it's weight in gold. It's helped me immensely with my perimenopause sleep and anxiety issues. I wont need to take the anti depressants that were prescribed to me."}, {"text": "Pycnogenol . Bought this for my wife. She is trying this item for its antioxidants properties.  this item is also selling at a much better price than my home country. Thank you iHerb for all the best prices."}, {"text": "Excellent!. with bile acid. Gallbladder removal is recommended to the person who did it. It is easy to digest not only greasy food but also ordinary meals. It contains higher lipase than other digestive enzymes, but is relatively cheaper."}, {"text": "I use this daily and miss it when I don't!. I heard about collagen hydrolysate during a time I was struggling with insomnia.  I also discovered I had thyroid problems and my once healthy nails were breaking all the time.  I began taking this product and I sleep through the night and my nails grow so much better.  I ran out recently and I find myself waking up again during the night.  I have seen improvement in my skin, my nails, and my sleep.  Highly recommend!"}, {"text": "Excellent!. Powder isna little bit strange taste maybe better is a capsule. But to the smoothie is very good to drink."}, {"text": "Works well. This worked well for me and did not cause any side-effects. I think it's necessary once or twice a year for anyone who loves sushi."}, {"text": "Good. I'm on my second bottle so far. Not really sure of any impact as yet. Not even sure how I'll know if there has been an impact as time goes by. I hope my veins are becoming cleaner, stronger & healthier. Ordering & receipt of shipments has been very easy & good."}, {"text": "Excellent!. Value for money. I will order it again!!!"}, {"text": "thank you. still  in the process of observing what is the effect in my health. not yet finished a bottle of this resveratrol."}, {"text": "Excellent!. Great product packed with super healthy nutrients. I mix it with smoothies or you can use it with water or juice. It gives you many of the nutrients you need for each day. I would recommend this product to anyone who wants to boost their health."}, {"text": "Excellent!. Liked Sports Research brand of Turmeric. It was our of stock, so I purchased California Gold brand. Same formula, I am happy with it,"}, {"text": "Excellent!. been using this for 3 months. my skin gets better"}, {"text": "Health Benefits Doesn’t Feel. I Took 1 Tablet Per Night After 45 Minutes to 1 hour of Dinner. But Still Doesn’t Understand Any Change Of My Body."}, {"text": "Excellent!. Effective when I am feeling the nerves\nThumbs up"}, {"text": "One of the best. One of the best flavors for Quest bars."}, {"text": "too early to tell. sorry, i dont see any effect on me still"}, {"text": "This product has great features!!!. Very good product!!!"}, {"text": "About this product.. It really works. It's good for your skin. I'm going to buy it again. Buy without regret!"}, {"text": "Kelp crazy. Good product, good price,love it."}, {"text": "Good. One small softgel, very easy to swallow. Arrived without any damage"}, {"text": "Multi mineral product. Complete, advanced mineral forms"}, {"text": "Excellent!. I herb makes shopping for my vitamins so easy and I save money too??"}, {"text": "Arthritis Medication. This product is effective and easy to take, but unfortunately it appears that I am allergic to it."}, {"text": "Okok. Tried it cause it’s cheaper than other female probiotics"}, {"text": "Excellent!. Excellent absorption was achieved using this - very happy."}, {"text": "Excellent!. Wooooow very niceee !!!!!!!"}, {"text": "Customer. Good price and quickly shipped."}, {"text": "Goooooood. I think this is good only i have to say good"}, {"text": "Choose this!. Worth the money you paid for"}, {"text": "good collagen. They say type 1 collagen helps the tendons and ligaments. I take a level half teaspoon mornings. \r\nAfter several days of taking this type 1 collagen, I noticed a decrease in some pain that I had in my knee for a few years when bending it under weight, although some occasional slight pain remains. \r\nI also take a capsule mornings of type 2 chicken sternum collagen from SwansonVitamins.com which after a few months I credit with getting rid of some bone on bone grating in my back and ankle."}, {"text": "Maximize your potential.... It's a great way to keep healthy in these times."}, {"text": "Brain power. I find that my mind is sharper, I have more energy and\na more positive mood."}, {"text": "Excellent!. Thanks for everything! For goods and service."}, {"text": "Excellent!. Great product, very usefull."}, {"text": "Good. I haven't finished the bottle yet but it's easy on the stomach and I'm hoping to see an improvement in my skin."}, {"text": "I like it. It's very helpful for me. my mornig is more powerful :)"}, {"text": "Excellent!. help my digestive system"}, {"text": "Good. Overall pleased with my purchase would definitely recommend and buy again"}, {"text": "Excellent!. Garlic is known for centuries that is a substance that offers great protection for a number of diseases from common cold to cardiovascular suport. This product is indeed odourless, highly potent and at the right price."}, {"text": "Excellent!. great products, will order again"}, {"text": "Good. Good product for the body and skin. I recommend it."}, {"text": "good. Good solid product"}, {"text": "digestive problem. it gives me nausea..."}, {"text": "Huge bottle, great value. It seems to work like any other Lysine tablets. I use it for prevention or treatment of cold sores, and it's fairly effective if you take at least 3 a day."}, {"text": "Excellent!. Great product! Good for Keto"}, {"text": "The best protein bar . Tasty and good"}, {"text": "Excellent!. use it as salad dressing"}, {"text": "I think it helps my brain. I have these before bed and i think it gives me a clearer head. As they are expensive i will finish my bottle and see if i miss it."}, {"text": "About this product.. Not strong enough"}, {"text": "TEST ITEM. THIS IS A TEST PRODUCT FOR ME TO SEE IF IT HELPS WITH MY PERIMENOPAUSE SYMPTOMS. I HAVE NOTICED SOME GOOD MENTAL CHANGES HOWEVER I HAVE GOTTEN ACNE FROM IT, PLUS IT IS A SHORT TERM USE PRODUCT SO I AM NOT SURE I WILL STICK WITH THIS ITEM."}, {"text": "Excellent!. the chocolate taste is a bit artificial but adding it to other collagen chocolate powder makes it a nice addition. this greens powder helps keep my bloating down"}, {"text": "Excellent!. Full spectrum of vitamins K is very useful for the human body. It helps to vitamin D3 to be available for human cells and helps calcium to build into the bones and not into the veins. No side effects."}, {"text": "Love Thorne. Highest quality supplements."}, {"text": "Excellent!. Husband and I have been taking this supplement for some time now. Feel that it has been keeping us pretty healthy!"}, {"text": "Great snack. Excellent snack, delicious, and highly recommended"}, {"text": "Good. Helps me with my headache."}, {"text": "Amazing product. Keeps my energy level up all day."}, {"text": "effective. Do not take it before going to bed.  Insomnia"}]